Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz3_wbz35/apps/ble/advanced_applications/ble_sensor_touch/firmware/src/packs/WBZ351_DFP/component/adchs.h
/*
 * Component description for ADCHS
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2023-02-01T05:15:15Z */
#ifndef _WBZ35_ADCHS_COMPONENT_H_
#define _WBZ35_ADCHS_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR ADCHS                                        */
/* ************************************************************************** */

/* -------- ADCHS_ADCCON1 : (ADCHS Offset: 0x00) (R/W 32)  -------- */
#define ADCHS_ADCCON1_RESETVALUE              _UINT32_(0x00)                                       /*  (ADCHS_ADCCON1)   Reset Value */

#define ADCHS_ADCCON1_DMABL_Pos               _UINT32_(0)                                          /* (ADCHS_ADCCON1) DMA to System RAM Buffer Length Size bits Position */
#define ADCHS_ADCCON1_DMABL_Msk               (_UINT32_(0x7) << ADCHS_ADCCON1_DMABL_Pos)           /* (ADCHS_ADCCON1) DMA to System RAM Buffer Length Size bits Mask */
#define ADCHS_ADCCON1_DMABL(value)            (ADCHS_ADCCON1_DMABL_Msk & (_UINT32_(value) << ADCHS_ADCCON1_DMABL_Pos)) /* Assigment of value for DMABL in the ADCHS_ADCCON1 register */
#define   ADCHS_ADCCON1_DMABL_128_DMABL_Val   _UINT32_(0x7)                                        /* (ADCHS_ADCCON1) Allocates 128 locations in system memory to each analog input  */
#define   ADCHS_ADCCON1_DMABL_64_DMABL_Val    _UINT32_(0x6)                                        /* (ADCHS_ADCCON1) Allocates 64 locations in system memory to each analog input  */
#define   ADCHS_ADCCON1_DMABL_32_DMABL_Val    _UINT32_(0x5)                                        /* (ADCHS_ADCCON1) Allocates 32 locations in system memory to each analog input  */
#define   ADCHS_ADCCON1_DMABL_16_DMABL_Val    _UINT32_(0x4)                                        /* (ADCHS_ADCCON1) Allocates 16 locations in system memory to each analog input  */
#define   ADCHS_ADCCON1_DMABL_8_DMABL_Val     _UINT32_(0x3)                                        /* (ADCHS_ADCCON1) Allocates 8 locations in system memory to each analog input  */
#define   ADCHS_ADCCON1_DMABL_4_DMABL_Val     _UINT32_(0x2)                                        /* (ADCHS_ADCCON1) Allocates 4 locations in system memory to each analog input  */
#define   ADCHS_ADCCON1_DMABL_2_DMABL_Val     _UINT32_(0x1)                                        /* (ADCHS_ADCCON1) Allocates 2 locations in system memory to each analog input  */
#define   ADCHS_ADCCON1_DMABL_1_DMABL_Val     _UINT32_(0x0)                                        /* (ADCHS_ADCCON1) Allocates 1 location in system memory to each analog input  */
#define ADCHS_ADCCON1_DMABL_128_DMABL         (ADCHS_ADCCON1_DMABL_128_DMABL_Val << ADCHS_ADCCON1_DMABL_Pos) /* (ADCHS_ADCCON1) Allocates 128 locations in system memory to each analog input Position  */
#define ADCHS_ADCCON1_DMABL_64_DMABL          (ADCHS_ADCCON1_DMABL_64_DMABL_Val << ADCHS_ADCCON1_DMABL_Pos) /* (ADCHS_ADCCON1) Allocates 64 locations in system memory to each analog input Position  */
#define ADCHS_ADCCON1_DMABL_32_DMABL          (ADCHS_ADCCON1_DMABL_32_DMABL_Val << ADCHS_ADCCON1_DMABL_Pos) /* (ADCHS_ADCCON1) Allocates 32 locations in system memory to each analog input Position  */
#define ADCHS_ADCCON1_DMABL_16_DMABL          (ADCHS_ADCCON1_DMABL_16_DMABL_Val << ADCHS_ADCCON1_DMABL_Pos) /* (ADCHS_ADCCON1) Allocates 16 locations in system memory to each analog input Position  */
#define ADCHS_ADCCON1_DMABL_8_DMABL           (ADCHS_ADCCON1_DMABL_8_DMABL_Val << ADCHS_ADCCON1_DMABL_Pos) /* (ADCHS_ADCCON1) Allocates 8 locations in system memory to each analog input Position  */
#define ADCHS_ADCCON1_DMABL_4_DMABL           (ADCHS_ADCCON1_DMABL_4_DMABL_Val << ADCHS_ADCCON1_DMABL_Pos) /* (ADCHS_ADCCON1) Allocates 4 locations in system memory to each analog input Position  */
#define ADCHS_ADCCON1_DMABL_2_DMABL           (ADCHS_ADCCON1_DMABL_2_DMABL_Val << ADCHS_ADCCON1_DMABL_Pos) /* (ADCHS_ADCCON1) Allocates 2 locations in system memory to each analog input Position  */
#define ADCHS_ADCCON1_DMABL_1_DMABL           (ADCHS_ADCCON1_DMABL_1_DMABL_Val << ADCHS_ADCCON1_DMABL_Pos) /* (ADCHS_ADCCON1) Allocates 1 location in system memory to each analog input Position  */
#define ADCHS_ADCCON1_STRGLVL_Pos             _UINT32_(3)                                          /* (ADCHS_ADCCON1) Scan Trigger High Level/Positive Edge Sensitivity bit Position */
#define ADCHS_ADCCON1_STRGLVL_Msk             (_UINT32_(0x1) << ADCHS_ADCCON1_STRGLVL_Pos)         /* (ADCHS_ADCCON1) Scan Trigger High Level/Positive Edge Sensitivity bit Mask */
#define ADCHS_ADCCON1_STRGLVL(value)          (ADCHS_ADCCON1_STRGLVL_Msk & (_UINT32_(value) << ADCHS_ADCCON1_STRGLVL_Pos)) /* Assigment of value for STRGLVL in the ADCHS_ADCCON1 register */
#define   ADCHS_ADCCON1_STRGLVL_SCTRIG_HIGH_Val _UINT32_(0x1)                                        /* (ADCHS_ADCCON1) Scan trigger is high level sensitive. Once STRIG mode is selected the scan trigger will continue for all selected analog inputs  */
#define   ADCHS_ADCCON1_STRGLVL_SCTRIG_POSEDGE_Val _UINT32_(0x0)                                        /* (ADCHS_ADCCON1) Scan trigger is positive edge sensitive. Once STRIG mode is selected only a single scan trigger will be generated which will complete the scan of all selected analog inputs. (TRGSRCx in the ADCTRGx register)  */
#define ADCHS_ADCCON1_STRGLVL_SCTRIG_HIGH     (ADCHS_ADCCON1_STRGLVL_SCTRIG_HIGH_Val << ADCHS_ADCCON1_STRGLVL_Pos) /* (ADCHS_ADCCON1) Scan trigger is high level sensitive. Once STRIG mode is selected the scan trigger will continue for all selected analog inputs Position  */
#define ADCHS_ADCCON1_STRGLVL_SCTRIG_POSEDGE  (ADCHS_ADCCON1_STRGLVL_SCTRIG_POSEDGE_Val << ADCHS_ADCCON1_STRGLVL_Pos) /* (ADCHS_ADCCON1) Scan trigger is positive edge sensitive. Once STRIG mode is selected only a single scan trigger will be generated which will complete the scan of all selected analog inputs. (TRGSRCx in the ADCTRGx register) Position  */
#define ADCHS_ADCCON1_IRQVS_Pos               _UINT32_(4)                                          /* (ADCHS_ADCCON1) Interrupt Vector Shift bits Position */
#define ADCHS_ADCCON1_IRQVS_Msk               (_UINT32_(0x7) << ADCHS_ADCCON1_IRQVS_Pos)           /* (ADCHS_ADCCON1) Interrupt Vector Shift bits Mask */
#define ADCHS_ADCCON1_IRQVS(value)            (ADCHS_ADCCON1_IRQVS_Msk & (_UINT32_(value) << ADCHS_ADCCON1_IRQVS_Pos)) /* Assigment of value for IRQVS in the ADCHS_ADCCON1 register */
#define   ADCHS_ADCCON1_IRQVS_SHL_7_Val       _UINT32_(0x7)                                        /* (ADCHS_ADCCON1) Shift x left 7 bit position  */
#define   ADCHS_ADCCON1_IRQVS_SHL_6_Val       _UINT32_(0x6)                                        /* (ADCHS_ADCCON1) Shift x left 6 bit position  */
#define   ADCHS_ADCCON1_IRQVS_SHL_5_Val       _UINT32_(0x5)                                        /* (ADCHS_ADCCON1) Shift x left 5 bit position  */
#define   ADCHS_ADCCON1_IRQVS_SHL_4_Val       _UINT32_(0x4)                                        /* (ADCHS_ADCCON1) Shift x left 4 bit position  */
#define   ADCHS_ADCCON1_IRQVS_SHL_3_Val       _UINT32_(0x3)                                        /* (ADCHS_ADCCON1) Shift x left 3 bit position  */
#define   ADCHS_ADCCON1_IRQVS_SHL_2_Val       _UINT32_(0x2)                                        /* (ADCHS_ADCCON1) Shift x left 2 bit position  */
#define   ADCHS_ADCCON1_IRQVS_SHL_1_Val       _UINT32_(0x1)                                        /* (ADCHS_ADCCON1) Shift x left 1 bit position  */
#define   ADCHS_ADCCON1_IRQVS_SHL_0_Val       _UINT32_(0x0)                                        /* (ADCHS_ADCCON1) Shift x left 0 bit position  */
#define ADCHS_ADCCON1_IRQVS_SHL_7             (ADCHS_ADCCON1_IRQVS_SHL_7_Val << ADCHS_ADCCON1_IRQVS_Pos) /* (ADCHS_ADCCON1) Shift x left 7 bit position Position  */
#define ADCHS_ADCCON1_IRQVS_SHL_6             (ADCHS_ADCCON1_IRQVS_SHL_6_Val << ADCHS_ADCCON1_IRQVS_Pos) /* (ADCHS_ADCCON1) Shift x left 6 bit position Position  */
#define ADCHS_ADCCON1_IRQVS_SHL_5             (ADCHS_ADCCON1_IRQVS_SHL_5_Val << ADCHS_ADCCON1_IRQVS_Pos) /* (ADCHS_ADCCON1) Shift x left 5 bit position Position  */
#define ADCHS_ADCCON1_IRQVS_SHL_4             (ADCHS_ADCCON1_IRQVS_SHL_4_Val << ADCHS_ADCCON1_IRQVS_Pos) /* (ADCHS_ADCCON1) Shift x left 4 bit position Position  */
#define ADCHS_ADCCON1_IRQVS_SHL_3             (ADCHS_ADCCON1_IRQVS_SHL_3_Val << ADCHS_ADCCON1_IRQVS_Pos) /* (ADCHS_ADCCON1) Shift x left 3 bit position Position  */
#define ADCHS_ADCCON1_IRQVS_SHL_2             (ADCHS_ADCCON1_IRQVS_SHL_2_Val << ADCHS_ADCCON1_IRQVS_Pos) /* (ADCHS_ADCCON1) Shift x left 2 bit position Position  */
#define ADCHS_ADCCON1_IRQVS_SHL_1             (ADCHS_ADCCON1_IRQVS_SHL_1_Val << ADCHS_ADCCON1_IRQVS_Pos) /* (ADCHS_ADCCON1) Shift x left 1 bit position Position  */
#define ADCHS_ADCCON1_IRQVS_SHL_0             (ADCHS_ADCCON1_IRQVS_SHL_0_Val << ADCHS_ADCCON1_IRQVS_Pos) /* (ADCHS_ADCCON1) Shift x left 0 bit position Position  */
#define ADCHS_ADCCON1_SCANEN_Pos              _UINT32_(8)                                          /* (ADCHS_ADCCON1)  Position */
#define ADCHS_ADCCON1_SCANEN_Msk              (_UINT32_(0x1) << ADCHS_ADCCON1_SCANEN_Pos)          /* (ADCHS_ADCCON1)  Mask */
#define ADCHS_ADCCON1_SCANEN(value)           (ADCHS_ADCCON1_SCANEN_Msk & (_UINT32_(value) << ADCHS_ADCCON1_SCANEN_Pos)) /* Assigment of value for SCANEN in the ADCHS_ADCCON1 register */
#define ADCHS_ADCCON1_FSYUPB_Pos              _UINT32_(9)                                          /* (ADCHS_ADCCON1)  Position */
#define ADCHS_ADCCON1_FSYUPB_Msk              (_UINT32_(0x1) << ADCHS_ADCCON1_FSYUPB_Pos)          /* (ADCHS_ADCCON1)  Mask */
#define ADCHS_ADCCON1_FSYUPB(value)           (ADCHS_ADCCON1_FSYUPB_Msk & (_UINT32_(value) << ADCHS_ADCCON1_FSYUPB_Pos)) /* Assigment of value for FSYUPB in the ADCHS_ADCCON1 register */
#define ADCHS_ADCCON1_FSYDMA_Pos              _UINT32_(10)                                         /* (ADCHS_ADCCON1)  Position */
#define ADCHS_ADCCON1_FSYDMA_Msk              (_UINT32_(0x1) << ADCHS_ADCCON1_FSYDMA_Pos)          /* (ADCHS_ADCCON1)  Mask */
#define ADCHS_ADCCON1_FSYDMA(value)           (ADCHS_ADCCON1_FSYDMA_Msk & (_UINT32_(value) << ADCHS_ADCCON1_FSYDMA_Pos)) /* Assigment of value for FSYDMA in the ADCHS_ADCCON1 register */
#define ADCHS_ADCCON1_CVD_EN_Pos              _UINT32_(11)                                         /* (ADCHS_ADCCON1) CVD Enable bit Position */
#define ADCHS_ADCCON1_CVD_EN_Msk              (_UINT32_(0x1) << ADCHS_ADCCON1_CVD_EN_Pos)          /* (ADCHS_ADCCON1) CVD Enable bit Mask */
#define ADCHS_ADCCON1_CVD_EN(value)           (ADCHS_ADCCON1_CVD_EN_Msk & (_UINT32_(value) << ADCHS_ADCCON1_CVD_EN_Pos)) /* Assigment of value for CVD_EN in the ADCHS_ADCCON1 register */
#define ADCHS_ADCCON1_SIDL_Pos                _UINT32_(13)                                         /* (ADCHS_ADCCON1) Stop in Idle Mode bit Position */
#define ADCHS_ADCCON1_SIDL_Msk                (_UINT32_(0x1) << ADCHS_ADCCON1_SIDL_Pos)            /* (ADCHS_ADCCON1) Stop in Idle Mode bit Mask */
#define ADCHS_ADCCON1_SIDL(value)             (ADCHS_ADCCON1_SIDL_Msk & (_UINT32_(value) << ADCHS_ADCCON1_SIDL_Pos)) /* Assigment of value for SIDL in the ADCHS_ADCCON1 register */
#define   ADCHS_ADCCON1_SIDL_DISCONTINUE_Val  _UINT32_(0x1)                                        /* (ADCHS_ADCCON1) Discontinue module operation when device enters Idle mode  */
#define   ADCHS_ADCCON1_SIDL_CONTINUE_Val     _UINT32_(0x0)                                        /* (ADCHS_ADCCON1) Continue module operation in Idle mode  */
#define ADCHS_ADCCON1_SIDL_DISCONTINUE        (ADCHS_ADCCON1_SIDL_DISCONTINUE_Val << ADCHS_ADCCON1_SIDL_Pos) /* (ADCHS_ADCCON1) Discontinue module operation when device enters Idle mode Position  */
#define ADCHS_ADCCON1_SIDL_CONTINUE           (ADCHS_ADCCON1_SIDL_CONTINUE_Val << ADCHS_ADCCON1_SIDL_Pos) /* (ADCHS_ADCCON1) Continue module operation in Idle mode Position  */
#define ADCHS_ADCCON1_FRZ_Pos                 _UINT32_(14)                                         /* (ADCHS_ADCCON1)  Position */
#define ADCHS_ADCCON1_FRZ_Msk                 (_UINT32_(0x1) << ADCHS_ADCCON1_FRZ_Pos)             /* (ADCHS_ADCCON1)  Mask */
#define ADCHS_ADCCON1_FRZ(value)              (ADCHS_ADCCON1_FRZ_Msk & (_UINT32_(value) << ADCHS_ADCCON1_FRZ_Pos)) /* Assigment of value for FRZ in the ADCHS_ADCCON1 register */
#define ADCHS_ADCCON1_ON_Pos                  _UINT32_(15)                                         /* (ADCHS_ADCCON1) ADC Module Enable bit Position */
#define ADCHS_ADCCON1_ON_Msk                  (_UINT32_(0x1) << ADCHS_ADCCON1_ON_Pos)              /* (ADCHS_ADCCON1) ADC Module Enable bit Mask */
#define ADCHS_ADCCON1_ON(value)               (ADCHS_ADCCON1_ON_Msk & (_UINT32_(value) << ADCHS_ADCCON1_ON_Pos)) /* Assigment of value for ON in the ADCHS_ADCCON1 register */
#define   ADCHS_ADCCON1_ON_ENABLED_Val        _UINT32_(0x1)                                        /* (ADCHS_ADCCON1) ADC module is enabled  */
#define   ADCHS_ADCCON1_ON_DISABLED_Val       _UINT32_(0x0)                                        /* (ADCHS_ADCCON1) ADC module is disabled  */
#define ADCHS_ADCCON1_ON_ENABLED              (ADCHS_ADCCON1_ON_ENABLED_Val << ADCHS_ADCCON1_ON_Pos) /* (ADCHS_ADCCON1) ADC module is enabled Position  */
#define ADCHS_ADCCON1_ON_DISABLED             (ADCHS_ADCCON1_ON_DISABLED_Val << ADCHS_ADCCON1_ON_Pos) /* (ADCHS_ADCCON1) ADC module is disabled Position  */
#define ADCHS_ADCCON1_STRGSRC_Pos             _UINT32_(16)                                         /* (ADCHS_ADCCON1) Scan Trigger Source Select bits Position */
#define ADCHS_ADCCON1_STRGSRC_Msk             (_UINT32_(0x1F) << ADCHS_ADCCON1_STRGSRC_Pos)        /* (ADCHS_ADCCON1) Scan Trigger Source Select bits Mask */
#define ADCHS_ADCCON1_STRGSRC(value)          (ADCHS_ADCCON1_STRGSRC_Msk & (_UINT32_(value) << ADCHS_ADCCON1_STRGSRC_Pos)) /* Assigment of value for STRGSRC in the ADCHS_ADCCON1 register */
#define   ADCHS_ADCCON1_STRGSRC_EXT_TRIG_VAL_Val _UINT32_(0x1F)                                       /* (ADCHS_ADCCON1) External trigger for validation  */
#define   ADCHS_ADCCON1_STRGSRC_EVSYS_47_Val  _UINT32_(0x10)                                       /* (ADCHS_ADCCON1) ADC_TRIG_16  */
#define   ADCHS_ADCCON1_STRGSRC_EVSYS_46_Val  _UINT32_(0xF)                                        /* (ADCHS_ADCCON1) ADC_TRIG_15  */
#define   ADCHS_ADCCON1_STRGSRC_EVSYS_45_Val  _UINT32_(0xE)                                        /* (ADCHS_ADCCON1) ADC_TRIG_14  */
#define   ADCHS_ADCCON1_STRGSRC_EVSYS_44_Val  _UINT32_(0xD)                                        /* (ADCHS_ADCCON1) ADC_TRIG_13  */
#define   ADCHS_ADCCON1_STRGSRC_EVSYS_43_Val  _UINT32_(0xC)                                        /* (ADCHS_ADCCON1) ADC_TRIG_12  */
#define   ADCHS_ADCCON1_STRGSRC_EVSYS_42_Val  _UINT32_(0xB)                                        /* (ADCHS_ADCCON1) ADC_TRIG_11  */
#define   ADCHS_ADCCON1_STRGSRC_EVSYS_41_Val  _UINT32_(0xA)                                        /* (ADCHS_ADCCON1) ADC_TRIG_10  */
#define   ADCHS_ADCCON1_STRGSRC_EVSYS_40_Val  _UINT32_(0x9)                                        /* (ADCHS_ADCCON1) ADC_TRIG_9  */
#define   ADCHS_ADCCON1_STRGSRC_EVSYS_39_Val  _UINT32_(0x8)                                        /* (ADCHS_ADCCON1) ADC_TRIG_8  */
#define   ADCHS_ADCCON1_STRGSRC_EVSYS_38_Val  _UINT32_(0x7)                                        /* (ADCHS_ADCCON1) ADC_TRIG_7  */
#define   ADCHS_ADCCON1_STRGSRC_EVSYS_37_Val  _UINT32_(0x6)                                        /* (ADCHS_ADCCON1) ADC_TRIG_6  */
#define   ADCHS_ADCCON1_STRGSRC_EVSYS_36_Val  _UINT32_(0x5)                                        /* (ADCHS_ADCCON1) ADC_TRIG_5  */
#define   ADCHS_ADCCON1_STRGSRC_INT0_Val      _UINT32_(0x4)                                        /* (ADCHS_ADCCON1) INT0  */
#define   ADCHS_ADCCON1_STRGSRC_RESERVED_Val  _UINT32_(0x3)                                        /* (ADCHS_ADCCON1) RESERVED  */
#define   ADCHS_ADCCON1_STRGSRC_SW_LVL_Val    _UINT32_(0x2)                                        /* (ADCHS_ADCCON1) Software level trigger  */
#define   ADCHS_ADCCON1_STRGSRC_SW_EDGE_Val   _UINT32_(0x1)                                        /* (ADCHS_ADCCON1) Software edge trigger  */
#define   ADCHS_ADCCON1_STRGSRC_NONE_Val      _UINT32_(0x0)                                        /* (ADCHS_ADCCON1) No Trigger  */
#define ADCHS_ADCCON1_STRGSRC_EXT_TRIG_VAL    (ADCHS_ADCCON1_STRGSRC_EXT_TRIG_VAL_Val << ADCHS_ADCCON1_STRGSRC_Pos) /* (ADCHS_ADCCON1) External trigger for validation Position  */
#define ADCHS_ADCCON1_STRGSRC_EVSYS_47        (ADCHS_ADCCON1_STRGSRC_EVSYS_47_Val << ADCHS_ADCCON1_STRGSRC_Pos) /* (ADCHS_ADCCON1) ADC_TRIG_16 Position  */
#define ADCHS_ADCCON1_STRGSRC_EVSYS_46        (ADCHS_ADCCON1_STRGSRC_EVSYS_46_Val << ADCHS_ADCCON1_STRGSRC_Pos) /* (ADCHS_ADCCON1) ADC_TRIG_15 Position  */
#define ADCHS_ADCCON1_STRGSRC_EVSYS_45        (ADCHS_ADCCON1_STRGSRC_EVSYS_45_Val << ADCHS_ADCCON1_STRGSRC_Pos) /* (ADCHS_ADCCON1) ADC_TRIG_14 Position  */
#define ADCHS_ADCCON1_STRGSRC_EVSYS_44        (ADCHS_ADCCON1_STRGSRC_EVSYS_44_Val << ADCHS_ADCCON1_STRGSRC_Pos) /* (ADCHS_ADCCON1) ADC_TRIG_13 Position  */
#define ADCHS_ADCCON1_STRGSRC_EVSYS_43        (ADCHS_ADCCON1_STRGSRC_EVSYS_43_Val << ADCHS_ADCCON1_STRGSRC_Pos) /* (ADCHS_ADCCON1) ADC_TRIG_12 Position  */
#define ADCHS_ADCCON1_STRGSRC_EVSYS_42        (ADCHS_ADCCON1_STRGSRC_EVSYS_42_Val << ADCHS_ADCCON1_STRGSRC_Pos) /* (ADCHS_ADCCON1) ADC_TRIG_11 Position  */
#define ADCHS_ADCCON1_STRGSRC_EVSYS_41        (ADCHS_ADCCON1_STRGSRC_EVSYS_41_Val << ADCHS_ADCCON1_STRGSRC_Pos) /* (ADCHS_ADCCON1) ADC_TRIG_10 Position  */
#define ADCHS_ADCCON1_STRGSRC_EVSYS_40        (ADCHS_ADCCON1_STRGSRC_EVSYS_40_Val << ADCHS_ADCCON1_STRGSRC_Pos) /* (ADCHS_ADCCON1) ADC_TRIG_9 Position  */
#define ADCHS_ADCCON1_STRGSRC_EVSYS_39        (ADCHS_ADCCON1_STRGSRC_EVSYS_39_Val << ADCHS_ADCCON1_STRGSRC_Pos) /* (ADCHS_ADCCON1) ADC_TRIG_8 Position  */
#define ADCHS_ADCCON1_STRGSRC_EVSYS_38        (ADCHS_ADCCON1_STRGSRC_EVSYS_38_Val << ADCHS_ADCCON1_STRGSRC_Pos) /* (ADCHS_ADCCON1) ADC_TRIG_7 Position  */
#define ADCHS_ADCCON1_STRGSRC_EVSYS_37        (ADCHS_ADCCON1_STRGSRC_EVSYS_37_Val << ADCHS_ADCCON1_STRGSRC_Pos) /* (ADCHS_ADCCON1) ADC_TRIG_6 Position  */
#define ADCHS_ADCCON1_STRGSRC_EVSYS_36        (ADCHS_ADCCON1_STRGSRC_EVSYS_36_Val << ADCHS_ADCCON1_STRGSRC_Pos) /* (ADCHS_ADCCON1) ADC_TRIG_5 Position  */
#define ADCHS_ADCCON1_STRGSRC_INT0            (ADCHS_ADCCON1_STRGSRC_INT0_Val << ADCHS_ADCCON1_STRGSRC_Pos) /* (ADCHS_ADCCON1) INT0 Position  */
#define ADCHS_ADCCON1_STRGSRC_RESERVED        (ADCHS_ADCCON1_STRGSRC_RESERVED_Val << ADCHS_ADCCON1_STRGSRC_Pos) /* (ADCHS_ADCCON1) RESERVED Position  */
#define ADCHS_ADCCON1_STRGSRC_SW_LVL          (ADCHS_ADCCON1_STRGSRC_SW_LVL_Val << ADCHS_ADCCON1_STRGSRC_Pos) /* (ADCHS_ADCCON1) Software level trigger Position  */
#define ADCHS_ADCCON1_STRGSRC_SW_EDGE         (ADCHS_ADCCON1_STRGSRC_SW_EDGE_Val << ADCHS_ADCCON1_STRGSRC_Pos) /* (ADCHS_ADCCON1) Software edge trigger Position  */
#define ADCHS_ADCCON1_STRGSRC_NONE            (ADCHS_ADCCON1_STRGSRC_NONE_Val << ADCHS_ADCCON1_STRGSRC_Pos) /* (ADCHS_ADCCON1) No Trigger Position  */
#define ADCHS_ADCCON1_SELRES_Pos              _UINT32_(21)                                         /* (ADCHS_ADCCON1) Shared ADC7 Resolution bits Position */
#define ADCHS_ADCCON1_SELRES_Msk              (_UINT32_(0x3) << ADCHS_ADCCON1_SELRES_Pos)          /* (ADCHS_ADCCON1) Shared ADC7 Resolution bits Mask */
#define ADCHS_ADCCON1_SELRES(value)           (ADCHS_ADCCON1_SELRES_Msk & (_UINT32_(value) << ADCHS_ADCCON1_SELRES_Pos)) /* Assigment of value for SELRES in the ADCHS_ADCCON1 register */
#define   ADCHS_ADCCON1_SELRES_12_BITS_Val    _UINT32_(0x3)                                        /* (ADCHS_ADCCON1) 12 bits (default)  */
#define   ADCHS_ADCCON1_SELRES_10_BITS_Val    _UINT32_(0x2)                                        /* (ADCHS_ADCCON1) 10 bits  */
#define   ADCHS_ADCCON1_SELRES_8_BITS_Val     _UINT32_(0x1)                                        /* (ADCHS_ADCCON1) 8 bits  */
#define   ADCHS_ADCCON1_SELRES_6_BITS_Val     _UINT32_(0x0)                                        /* (ADCHS_ADCCON1) 6 bits  */
#define ADCHS_ADCCON1_SELRES_12_BITS          (ADCHS_ADCCON1_SELRES_12_BITS_Val << ADCHS_ADCCON1_SELRES_Pos) /* (ADCHS_ADCCON1) 12 bits (default) Position  */
#define ADCHS_ADCCON1_SELRES_10_BITS          (ADCHS_ADCCON1_SELRES_10_BITS_Val << ADCHS_ADCCON1_SELRES_Pos) /* (ADCHS_ADCCON1) 10 bits Position  */
#define ADCHS_ADCCON1_SELRES_8_BITS           (ADCHS_ADCCON1_SELRES_8_BITS_Val << ADCHS_ADCCON1_SELRES_Pos) /* (ADCHS_ADCCON1) 8 bits Position  */
#define ADCHS_ADCCON1_SELRES_6_BITS           (ADCHS_ADCCON1_SELRES_6_BITS_Val << ADCHS_ADCCON1_SELRES_Pos) /* (ADCHS_ADCCON1) 6 bits Position  */
#define ADCHS_ADCCON1_FRACT_Pos               _UINT32_(23)                                         /* (ADCHS_ADCCON1) Fractional Data Output Format bit Position */
#define ADCHS_ADCCON1_FRACT_Msk               (_UINT32_(0x1) << ADCHS_ADCCON1_FRACT_Pos)           /* (ADCHS_ADCCON1) Fractional Data Output Format bit Mask */
#define ADCHS_ADCCON1_FRACT(value)            (ADCHS_ADCCON1_FRACT_Msk & (_UINT32_(value) << ADCHS_ADCCON1_FRACT_Pos)) /* Assigment of value for FRACT in the ADCHS_ADCCON1 register */
#define   ADCHS_ADCCON1_FRACT_FRAC_Val        _UINT32_(0x1)                                        /* (ADCHS_ADCCON1) Fractional  */
#define   ADCHS_ADCCON1_FRACT_INT_Val         _UINT32_(0x0)                                        /* (ADCHS_ADCCON1) Integer  */
#define ADCHS_ADCCON1_FRACT_FRAC              (ADCHS_ADCCON1_FRACT_FRAC_Val << ADCHS_ADCCON1_FRACT_Pos) /* (ADCHS_ADCCON1) Fractional Position  */
#define ADCHS_ADCCON1_FRACT_INT               (ADCHS_ADCCON1_FRACT_INT_Val << ADCHS_ADCCON1_FRACT_Pos) /* (ADCHS_ADCCON1) Integer Position  */
#define ADCHS_ADCCON1_Msk                     _UINT32_(0x00FFEF7F)                                 /* (ADCHS_ADCCON1) Register Mask  */


