Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz3_wbz35/apps/ble/advanced_applications/ble_sensor_touch/firmware/src/packs/WBZ351_DFP/component/adchs.h
#define ADCHS_ADCCON3CLR_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCCON3CLR) Register Mask  */


/* -------- ADCHS_ADCCON3SET : (ADCHS Offset: 0x28) (R/W 32) Bit set register -------- */
#define ADCHS_ADCCON3SET_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCCON3SET) Bit set register  Reset Value */

#define ADCHS_ADCCON3SET_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCCON3SET) Register Mask  */


/* -------- ADCHS_ADCCON3INV : (ADCHS Offset: 0x2C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCCON3INV_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCCON3INV) Bit invert register  Reset Value */

#define ADCHS_ADCCON3INV_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCCON3INV) Register Mask  */


/* -------- ADCHS_ADCIMCON1 : (ADCHS Offset: 0x40) (R/W 32)  -------- */
#define ADCHS_ADCIMCON1_RESETVALUE            _UINT32_(0x00)                                       /*  (ADCHS_ADCIMCON1)   Reset Value */

#define ADCHS_ADCIMCON1_SIGN0_Pos             _UINT32_(0)                                          /* (ADCHS_ADCIMCON1) AN0 Signed Data Mode bit Position */
#define ADCHS_ADCIMCON1_SIGN0_Msk             (_UINT32_(0x1) << ADCHS_ADCIMCON1_SIGN0_Pos)         /* (ADCHS_ADCIMCON1) AN0 Signed Data Mode bit Mask */
#define ADCHS_ADCIMCON1_SIGN0(value)          (ADCHS_ADCIMCON1_SIGN0_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_SIGN0_Pos)) /* Assigment of value for SIGN0 in the ADCHS_ADCIMCON1 register */
#define   ADCHS_ADCIMCON1_SIGN0_SIGNED_Val    _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) AN0 is using Signed Data mode  */
#define   ADCHS_ADCIMCON1_SIGN0_UNSIGNED_Val  _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN0 is using Unsigned Data mode  */
#define ADCHS_ADCIMCON1_SIGN0_SIGNED          (ADCHS_ADCIMCON1_SIGN0_SIGNED_Val << ADCHS_ADCIMCON1_SIGN0_Pos) /* (ADCHS_ADCIMCON1) AN0 is using Signed Data mode Position  */
#define ADCHS_ADCIMCON1_SIGN0_UNSIGNED        (ADCHS_ADCIMCON1_SIGN0_UNSIGNED_Val << ADCHS_ADCIMCON1_SIGN0_Pos) /* (ADCHS_ADCIMCON1) AN0 is using Unsigned Data mode Position  */
#define ADCHS_ADCIMCON1_DIFF0_Pos             _UINT32_(1)                                          /* (ADCHS_ADCIMCON1) AN0 Mode bit Position */
#define ADCHS_ADCIMCON1_DIFF0_Msk             (_UINT32_(0x1) << ADCHS_ADCIMCON1_DIFF0_Pos)         /* (ADCHS_ADCIMCON1) AN0 Mode bit Mask */
#define ADCHS_ADCIMCON1_DIFF0(value)          (ADCHS_ADCIMCON1_DIFF0_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_DIFF0_Pos)) /* Assigment of value for DIFF0 in the ADCHS_ADCIMCON1 register */
#define   ADCHS_ADCIMCON1_DIFF0_DIFF_Val      _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) Selects AN0 differential input pair as AN0+ and ANN0-  */
#define   ADCHS_ADCIMCON1_DIFF0_SINGLE_Val    _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN0 is using Single-ended mode  */
#define ADCHS_ADCIMCON1_DIFF0_DIFF            (ADCHS_ADCIMCON1_DIFF0_DIFF_Val << ADCHS_ADCIMCON1_DIFF0_Pos) /* (ADCHS_ADCIMCON1) Selects AN0 differential input pair as AN0+ and ANN0- Position  */
#define ADCHS_ADCIMCON1_DIFF0_SINGLE          (ADCHS_ADCIMCON1_DIFF0_SINGLE_Val << ADCHS_ADCIMCON1_DIFF0_Pos) /* (ADCHS_ADCIMCON1) AN0 is using Single-ended mode Position  */
#define ADCHS_ADCIMCON1_SIGN1_Pos             _UINT32_(2)                                          /* (ADCHS_ADCIMCON1) AN1 Signed Data Mode bit Position */
#define ADCHS_ADCIMCON1_SIGN1_Msk             (_UINT32_(0x1) << ADCHS_ADCIMCON1_SIGN1_Pos)         /* (ADCHS_ADCIMCON1) AN1 Signed Data Mode bit Mask */
#define ADCHS_ADCIMCON1_SIGN1(value)          (ADCHS_ADCIMCON1_SIGN1_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_SIGN1_Pos)) /* Assigment of value for SIGN1 in the ADCHS_ADCIMCON1 register */
#define   ADCHS_ADCIMCON1_SIGN1_SIGNED_Val    _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) AN1 is using Signed Data mode  */
#define   ADCHS_ADCIMCON1_SIGN1_UNSIGNED_Val  _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN1 is using Unsigned Data mode  */
#define ADCHS_ADCIMCON1_SIGN1_SIGNED          (ADCHS_ADCIMCON1_SIGN1_SIGNED_Val << ADCHS_ADCIMCON1_SIGN1_Pos) /* (ADCHS_ADCIMCON1) AN1 is using Signed Data mode Position  */
#define ADCHS_ADCIMCON1_SIGN1_UNSIGNED        (ADCHS_ADCIMCON1_SIGN1_UNSIGNED_Val << ADCHS_ADCIMCON1_SIGN1_Pos) /* (ADCHS_ADCIMCON1) AN1 is using Unsigned Data mode Position  */
#define ADCHS_ADCIMCON1_DIFF1_Pos             _UINT32_(3)                                          /* (ADCHS_ADCIMCON1) AN1 Mode bit Position */
#define ADCHS_ADCIMCON1_DIFF1_Msk             (_UINT32_(0x1) << ADCHS_ADCIMCON1_DIFF1_Pos)         /* (ADCHS_ADCIMCON1) AN1 Mode bit Mask */
#define ADCHS_ADCIMCON1_DIFF1(value)          (ADCHS_ADCIMCON1_DIFF1_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_DIFF1_Pos)) /* Assigment of value for DIFF1 in the ADCHS_ADCIMCON1 register */
#define   ADCHS_ADCIMCON1_DIFF1_DIFF_Val      _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) Selects AN1 differential input pair as AN1+ and ANN0-  */
#define   ADCHS_ADCIMCON1_DIFF1_SINGLE_Val    _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN1 is using Single-ended mode  */
#define ADCHS_ADCIMCON1_DIFF1_DIFF            (ADCHS_ADCIMCON1_DIFF1_DIFF_Val << ADCHS_ADCIMCON1_DIFF1_Pos) /* (ADCHS_ADCIMCON1) Selects AN1 differential input pair as AN1+ and ANN0- Position  */
#define ADCHS_ADCIMCON1_DIFF1_SINGLE          (ADCHS_ADCIMCON1_DIFF1_SINGLE_Val << ADCHS_ADCIMCON1_DIFF1_Pos) /* (ADCHS_ADCIMCON1) AN1 is using Single-ended mode Position  */
#define ADCHS_ADCIMCON1_SIGN2_Pos             _UINT32_(4)                                          /* (ADCHS_ADCIMCON1) AN2 Signed Data Mode bit Position */
#define ADCHS_ADCIMCON1_SIGN2_Msk             (_UINT32_(0x1) << ADCHS_ADCIMCON1_SIGN2_Pos)         /* (ADCHS_ADCIMCON1) AN2 Signed Data Mode bit Mask */
#define ADCHS_ADCIMCON1_SIGN2(value)          (ADCHS_ADCIMCON1_SIGN2_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_SIGN2_Pos)) /* Assigment of value for SIGN2 in the ADCHS_ADCIMCON1 register */
#define   ADCHS_ADCIMCON1_SIGN2_SIGNED_Val    _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) AN2 is using Signed Data mode  */
#define   ADCHS_ADCIMCON1_SIGN2_UNSIGNED_Val  _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN2 is using Unsigned Data mode  */
#define ADCHS_ADCIMCON1_SIGN2_SIGNED          (ADCHS_ADCIMCON1_SIGN2_SIGNED_Val << ADCHS_ADCIMCON1_SIGN2_Pos) /* (ADCHS_ADCIMCON1) AN2 is using Signed Data mode Position  */
#define ADCHS_ADCIMCON1_SIGN2_UNSIGNED        (ADCHS_ADCIMCON1_SIGN2_UNSIGNED_Val << ADCHS_ADCIMCON1_SIGN2_Pos) /* (ADCHS_ADCIMCON1) AN2 is using Unsigned Data mode Position  */
#define ADCHS_ADCIMCON1_DIFF2_Pos             _UINT32_(5)                                          /* (ADCHS_ADCIMCON1) AN2 Mode bit Position */
#define ADCHS_ADCIMCON1_DIFF2_Msk             (_UINT32_(0x1) << ADCHS_ADCIMCON1_DIFF2_Pos)         /* (ADCHS_ADCIMCON1) AN2 Mode bit Mask */
#define ADCHS_ADCIMCON1_DIFF2(value)          (ADCHS_ADCIMCON1_DIFF2_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_DIFF2_Pos)) /* Assigment of value for DIFF2 in the ADCHS_ADCIMCON1 register */
#define   ADCHS_ADCIMCON1_DIFF2_DIFF_Val      _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) Selects AN2 differential input pair as AN2+ and ANN0-  */
#define   ADCHS_ADCIMCON1_DIFF2_SINGLE_Val    _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN2 is using Single-ended mode  */
#define ADCHS_ADCIMCON1_DIFF2_DIFF            (ADCHS_ADCIMCON1_DIFF2_DIFF_Val << ADCHS_ADCIMCON1_DIFF2_Pos) /* (ADCHS_ADCIMCON1) Selects AN2 differential input pair as AN2+ and ANN0- Position  */
#define ADCHS_ADCIMCON1_DIFF2_SINGLE          (ADCHS_ADCIMCON1_DIFF2_SINGLE_Val << ADCHS_ADCIMCON1_DIFF2_Pos) /* (ADCHS_ADCIMCON1) AN2 is using Single-ended mode Position  */
#define ADCHS_ADCIMCON1_SIGN3_Pos             _UINT32_(6)                                          /* (ADCHS_ADCIMCON1) AN3 Signed Data Mode bit Position */
#define ADCHS_ADCIMCON1_SIGN3_Msk             (_UINT32_(0x1) << ADCHS_ADCIMCON1_SIGN3_Pos)         /* (ADCHS_ADCIMCON1) AN3 Signed Data Mode bit Mask */
#define ADCHS_ADCIMCON1_SIGN3(value)          (ADCHS_ADCIMCON1_SIGN3_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_SIGN3_Pos)) /* Assigment of value for SIGN3 in the ADCHS_ADCIMCON1 register */
#define   ADCHS_ADCIMCON1_SIGN3_SIGNED_Val    _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) AN3 is using Signed Data mode  */
#define   ADCHS_ADCIMCON1_SIGN3_UNSIGNED_Val  _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN3 is using Unsigned Data mode  */
#define ADCHS_ADCIMCON1_SIGN3_SIGNED          (ADCHS_ADCIMCON1_SIGN3_SIGNED_Val << ADCHS_ADCIMCON1_SIGN3_Pos) /* (ADCHS_ADCIMCON1) AN3 is using Signed Data mode Position  */
#define ADCHS_ADCIMCON1_SIGN3_UNSIGNED        (ADCHS_ADCIMCON1_SIGN3_UNSIGNED_Val << ADCHS_ADCIMCON1_SIGN3_Pos) /* (ADCHS_ADCIMCON1) AN3 is using Unsigned Data mode Position  */
#define ADCHS_ADCIMCON1_DIFF3_Pos             _UINT32_(7)                                          /* (ADCHS_ADCIMCON1) AN3 Mode bit Position */
#define ADCHS_ADCIMCON1_DIFF3_Msk             (_UINT32_(0x1) << ADCHS_ADCIMCON1_DIFF3_Pos)         /* (ADCHS_ADCIMCON1) AN3 Mode bit Mask */
#define ADCHS_ADCIMCON1_DIFF3(value)          (ADCHS_ADCIMCON1_DIFF3_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_DIFF3_Pos)) /* Assigment of value for DIFF3 in the ADCHS_ADCIMCON1 register */
#define   ADCHS_ADCIMCON1_DIFF3_DIFF_Val      _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) Selects AN3 differential input pair as AN3+ and ANN0-  */
#define   ADCHS_ADCIMCON1_DIFF3_SINGLE_Val    _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN3 is using Single-ended mode  */
#define ADCHS_ADCIMCON1_DIFF3_DIFF            (ADCHS_ADCIMCON1_DIFF3_DIFF_Val << ADCHS_ADCIMCON1_DIFF3_Pos) /* (ADCHS_ADCIMCON1) Selects AN3 differential input pair as AN3+ and ANN0- Position  */
#define ADCHS_ADCIMCON1_DIFF3_SINGLE          (ADCHS_ADCIMCON1_DIFF3_SINGLE_Val << ADCHS_ADCIMCON1_DIFF3_Pos) /* (ADCHS_ADCIMCON1) AN3 is using Single-ended mode Position  */
#define ADCHS_ADCIMCON1_SIGN4_Pos             _UINT32_(8)                                          /* (ADCHS_ADCIMCON1) AN4 Signed Data Mode bit Position */
#define ADCHS_ADCIMCON1_SIGN4_Msk             (_UINT32_(0x1) << ADCHS_ADCIMCON1_SIGN4_Pos)         /* (ADCHS_ADCIMCON1) AN4 Signed Data Mode bit Mask */
#define ADCHS_ADCIMCON1_SIGN4(value)          (ADCHS_ADCIMCON1_SIGN4_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_SIGN4_Pos)) /* Assigment of value for SIGN4 in the ADCHS_ADCIMCON1 register */
#define   ADCHS_ADCIMCON1_SIGN4_SIGNED_Val    _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) AN4 is using Signed Data mode  */
#define   ADCHS_ADCIMCON1_SIGN4_UNSIGNED_Val  _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN4 is using Unsigned Data mode  */
#define ADCHS_ADCIMCON1_SIGN4_SIGNED          (ADCHS_ADCIMCON1_SIGN4_SIGNED_Val << ADCHS_ADCIMCON1_SIGN4_Pos) /* (ADCHS_ADCIMCON1) AN4 is using Signed Data mode Position  */
#define ADCHS_ADCIMCON1_SIGN4_UNSIGNED        (ADCHS_ADCIMCON1_SIGN4_UNSIGNED_Val << ADCHS_ADCIMCON1_SIGN4_Pos) /* (ADCHS_ADCIMCON1) AN4 is using Unsigned Data mode Position  */
#define ADCHS_ADCIMCON1_DIFF4_Pos             _UINT32_(9)                                          /* (ADCHS_ADCIMCON1) AN4 Mode bit Position */
#define ADCHS_ADCIMCON1_DIFF4_Msk             (_UINT32_(0x1) << ADCHS_ADCIMCON1_DIFF4_Pos)         /* (ADCHS_ADCIMCON1) AN4 Mode bit Mask */
#define ADCHS_ADCIMCON1_DIFF4(value)          (ADCHS_ADCIMCON1_DIFF4_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_DIFF4_Pos)) /* Assigment of value for DIFF4 in the ADCHS_ADCIMCON1 register */
#define   ADCHS_ADCIMCON1_DIFF4_DIFF_Val      _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) Selects AN4 differential input pair as AN4+ and ANN0-  */
#define   ADCHS_ADCIMCON1_DIFF4_SINGLE_Val    _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN4 is using Single-ended mode  */
#define ADCHS_ADCIMCON1_DIFF4_DIFF            (ADCHS_ADCIMCON1_DIFF4_DIFF_Val << ADCHS_ADCIMCON1_DIFF4_Pos) /* (ADCHS_ADCIMCON1) Selects AN4 differential input pair as AN4+ and ANN0- Position  */
#define ADCHS_ADCIMCON1_DIFF4_SINGLE          (ADCHS_ADCIMCON1_DIFF4_SINGLE_Val << ADCHS_ADCIMCON1_DIFF4_Pos) /* (ADCHS_ADCIMCON1) AN4 is using Single-ended mode Position  */
#define ADCHS_ADCIMCON1_SIGN5_Pos             _UINT32_(10)                                         /* (ADCHS_ADCIMCON1) AN5 Signed Data Mode bit Position */
#define ADCHS_ADCIMCON1_SIGN5_Msk             (_UINT32_(0x1) << ADCHS_ADCIMCON1_SIGN5_Pos)         /* (ADCHS_ADCIMCON1) AN5 Signed Data Mode bit Mask */
#define ADCHS_ADCIMCON1_SIGN5(value)          (ADCHS_ADCIMCON1_SIGN5_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_SIGN5_Pos)) /* Assigment of value for SIGN5 in the ADCHS_ADCIMCON1 register */
#define   ADCHS_ADCIMCON1_SIGN5_SIGNED_Val    _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) AN5 is using Signed Data mode  */
#define   ADCHS_ADCIMCON1_SIGN5_UNSIGNED_Val  _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN5 is using Unsigned Data mode  */
#define ADCHS_ADCIMCON1_SIGN5_SIGNED          (ADCHS_ADCIMCON1_SIGN5_SIGNED_Val << ADCHS_ADCIMCON1_SIGN5_Pos) /* (ADCHS_ADCIMCON1) AN5 is using Signed Data mode Position  */
#define ADCHS_ADCIMCON1_SIGN5_UNSIGNED        (ADCHS_ADCIMCON1_SIGN5_UNSIGNED_Val << ADCHS_ADCIMCON1_SIGN5_Pos) /* (ADCHS_ADCIMCON1) AN5 is using Unsigned Data mode Position  */
#define ADCHS_ADCIMCON1_DIFF5_Pos             _UINT32_(11)                                         /* (ADCHS_ADCIMCON1) AN5 Mode bit Position */
#define ADCHS_ADCIMCON1_DIFF5_Msk             (_UINT32_(0x1) << ADCHS_ADCIMCON1_DIFF5_Pos)         /* (ADCHS_ADCIMCON1) AN5 Mode bit Mask */
#define ADCHS_ADCIMCON1_DIFF5(value)          (ADCHS_ADCIMCON1_DIFF5_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_DIFF5_Pos)) /* Assigment of value for DIFF5 in the ADCHS_ADCIMCON1 register */
#define   ADCHS_ADCIMCON1_DIFF5_DIFF_Val      _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) Selects AN5 differential input pair as AN5+ and ANN0-  */
#define   ADCHS_ADCIMCON1_DIFF5_SINGLE_Val    _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN5 is using Single-ended mode  */
#define ADCHS_ADCIMCON1_DIFF5_DIFF            (ADCHS_ADCIMCON1_DIFF5_DIFF_Val << ADCHS_ADCIMCON1_DIFF5_Pos) /* (ADCHS_ADCIMCON1) Selects AN5 differential input pair as AN5+ and ANN0- Position  */
#define ADCHS_ADCIMCON1_DIFF5_SINGLE          (ADCHS_ADCIMCON1_DIFF5_SINGLE_Val << ADCHS_ADCIMCON1_DIFF5_Pos) /* (ADCHS_ADCIMCON1) AN5 is using Single-ended mode Position  */
#define ADCHS_ADCIMCON1_SIGN6_Pos             _UINT32_(12)                                         /* (ADCHS_ADCIMCON1) AN6 Signed Data Mode bit Position */
#define ADCHS_ADCIMCON1_SIGN6_Msk             (_UINT32_(0x1) << ADCHS_ADCIMCON1_SIGN6_Pos)         /* (ADCHS_ADCIMCON1) AN6 Signed Data Mode bit Mask */
#define ADCHS_ADCIMCON1_SIGN6(value)          (ADCHS_ADCIMCON1_SIGN6_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_SIGN6_Pos)) /* Assigment of value for SIGN6 in the ADCHS_ADCIMCON1 register */
#define   ADCHS_ADCIMCON1_SIGN6_SIGNED_Val    _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) AN6 is using Signed Data mode  */
#define   ADCHS_ADCIMCON1_SIGN6_UNSIGNED_Val  _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN6 is using Unsigned Data mode  */
#define ADCHS_ADCIMCON1_SIGN6_SIGNED          (ADCHS_ADCIMCON1_SIGN6_SIGNED_Val << ADCHS_ADCIMCON1_SIGN6_Pos) /* (ADCHS_ADCIMCON1) AN6 is using Signed Data mode Position  */
#define ADCHS_ADCIMCON1_SIGN6_UNSIGNED        (ADCHS_ADCIMCON1_SIGN6_UNSIGNED_Val << ADCHS_ADCIMCON1_SIGN6_Pos) /* (ADCHS_ADCIMCON1) AN6 is using Unsigned Data mode Position  */
#define ADCHS_ADCIMCON1_DIFF6_Pos             _UINT32_(13)                                         /* (ADCHS_ADCIMCON1) AN6 Mode bit Position */
#define ADCHS_ADCIMCON1_DIFF6_Msk             (_UINT32_(0x1) << ADCHS_ADCIMCON1_DIFF6_Pos)         /* (ADCHS_ADCIMCON1) AN6 Mode bit Mask */
#define ADCHS_ADCIMCON1_DIFF6(value)          (ADCHS_ADCIMCON1_DIFF6_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_DIFF6_Pos)) /* Assigment of value for DIFF6 in the ADCHS_ADCIMCON1 register */
#define   ADCHS_ADCIMCON1_DIFF6_DIFF_Val      _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) Selects AN6 differential input pair as AN6+ and ANN0-  */
#define   ADCHS_ADCIMCON1_DIFF6_SINGLE_Val    _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN6 is using Single-ended mode  */
#define ADCHS_ADCIMCON1_DIFF6_DIFF            (ADCHS_ADCIMCON1_DIFF6_DIFF_Val << ADCHS_ADCIMCON1_DIFF6_Pos) /* (ADCHS_ADCIMCON1) Selects AN6 differential input pair as AN6+ and ANN0- Position  */
#define ADCHS_ADCIMCON1_DIFF6_SINGLE          (ADCHS_ADCIMCON1_DIFF6_SINGLE_Val << ADCHS_ADCIMCON1_DIFF6_Pos) /* (ADCHS_ADCIMCON1) AN6 is using Single-ended mode Position  */
#define ADCHS_ADCIMCON1_SIGN7_Pos             _UINT32_(14)                                         /* (ADCHS_ADCIMCON1) AN7 Signed Data Mode bit Position */
#define ADCHS_ADCIMCON1_SIGN7_Msk             (_UINT32_(0x1) << ADCHS_ADCIMCON1_SIGN7_Pos)         /* (ADCHS_ADCIMCON1) AN7 Signed Data Mode bit Mask */
#define ADCHS_ADCIMCON1_SIGN7(value)          (ADCHS_ADCIMCON1_SIGN7_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_SIGN7_Pos)) /* Assigment of value for SIGN7 in the ADCHS_ADCIMCON1 register */
#define   ADCHS_ADCIMCON1_SIGN7_SIGNED_Val    _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) AN7 is using Signed Data mode  */
#define   ADCHS_ADCIMCON1_SIGN7_UNSIGNED_Val  _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN7 is using Unsigned Data mode  */
#define ADCHS_ADCIMCON1_SIGN7_SIGNED          (ADCHS_ADCIMCON1_SIGN7_SIGNED_Val << ADCHS_ADCIMCON1_SIGN7_Pos) /* (ADCHS_ADCIMCON1) AN7 is using Signed Data mode Position  */
#define ADCHS_ADCIMCON1_SIGN7_UNSIGNED        (ADCHS_ADCIMCON1_SIGN7_UNSIGNED_Val << ADCHS_ADCIMCON1_SIGN7_Pos) /* (ADCHS_ADCIMCON1) AN7 is using Unsigned Data mode Position  */
#define ADCHS_ADCIMCON1_DIFF7_Pos             _UINT32_(15)                                         /* (ADCHS_ADCIMCON1) AN7 Mode bit Position */
#define ADCHS_ADCIMCON1_DIFF7_Msk             (_UINT32_(0x1) << ADCHS_ADCIMCON1_DIFF7_Pos)         /* (ADCHS_ADCIMCON1) AN7 Mode bit Mask */
#define ADCHS_ADCIMCON1_DIFF7(value)          (ADCHS_ADCIMCON1_DIFF7_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_DIFF7_Pos)) /* Assigment of value for DIFF7 in the ADCHS_ADCIMCON1 register */
#define   ADCHS_ADCIMCON1_DIFF7_DIFF_Val      _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) Selects AN7 differential input pair as AN7+ and ANN0-  */
#define   ADCHS_ADCIMCON1_DIFF7_SINGLE_Val    _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN7 is using Single-ended mode  */
#define ADCHS_ADCIMCON1_DIFF7_DIFF            (ADCHS_ADCIMCON1_DIFF7_DIFF_Val << ADCHS_ADCIMCON1_DIFF7_Pos) /* (ADCHS_ADCIMCON1) Selects AN7 differential input pair as AN7+ and ANN0- Position  */
#define ADCHS_ADCIMCON1_DIFF7_SINGLE          (ADCHS_ADCIMCON1_DIFF7_SINGLE_Val << ADCHS_ADCIMCON1_DIFF7_Pos) /* (ADCHS_ADCIMCON1) AN7 is using Single-ended mode Position  */
#define ADCHS_ADCIMCON1_SIGN8_Pos             _UINT32_(16)                                         /* (ADCHS_ADCIMCON1) AN8 Signed Data Mode bit Position */
#define ADCHS_ADCIMCON1_SIGN8_Msk             (_UINT32_(0x1) << ADCHS_ADCIMCON1_SIGN8_Pos)         /* (ADCHS_ADCIMCON1) AN8 Signed Data Mode bit Mask */
#define ADCHS_ADCIMCON1_SIGN8(value)          (ADCHS_ADCIMCON1_SIGN8_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_SIGN8_Pos)) /* Assigment of value for SIGN8 in the ADCHS_ADCIMCON1 register */
#define   ADCHS_ADCIMCON1_SIGN8_SIGNED_Val    _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) AN8 is using Signed Data mode  */
#define   ADCHS_ADCIMCON1_SIGN8_UNSIGNED_Val  _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN8 is using Unsigned Data mode  */
#define ADCHS_ADCIMCON1_SIGN8_SIGNED          (ADCHS_ADCIMCON1_SIGN8_SIGNED_Val << ADCHS_ADCIMCON1_SIGN8_Pos) /* (ADCHS_ADCIMCON1) AN8 is using Signed Data mode Position  */
#define ADCHS_ADCIMCON1_SIGN8_UNSIGNED        (ADCHS_ADCIMCON1_SIGN8_UNSIGNED_Val << ADCHS_ADCIMCON1_SIGN8_Pos) /* (ADCHS_ADCIMCON1) AN8 is using Unsigned Data mode Position  */
#define ADCHS_ADCIMCON1_DIFF8_Pos             _UINT32_(17)                                         /* (ADCHS_ADCIMCON1) AN 8 Mode bit Position */
#define ADCHS_ADCIMCON1_DIFF8_Msk             (_UINT32_(0x1) << ADCHS_ADCIMCON1_DIFF8_Pos)         /* (ADCHS_ADCIMCON1) AN 8 Mode bit Mask */
#define ADCHS_ADCIMCON1_DIFF8(value)          (ADCHS_ADCIMCON1_DIFF8_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_DIFF8_Pos)) /* Assigment of value for DIFF8 in the ADCHS_ADCIMCON1 register */
#define   ADCHS_ADCIMCON1_DIFF8_DIFF_Val      _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) Selects AN8 differential input pair as AN8+ and ANN0-  */
#define   ADCHS_ADCIMCON1_DIFF8_SINGLE_Val    _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN8 is using Single-ended mode  */
#define ADCHS_ADCIMCON1_DIFF8_DIFF            (ADCHS_ADCIMCON1_DIFF8_DIFF_Val << ADCHS_ADCIMCON1_DIFF8_Pos) /* (ADCHS_ADCIMCON1) Selects AN8 differential input pair as AN8+ and ANN0- Position  */
#define ADCHS_ADCIMCON1_DIFF8_SINGLE          (ADCHS_ADCIMCON1_DIFF8_SINGLE_Val << ADCHS_ADCIMCON1_DIFF8_Pos) /* (ADCHS_ADCIMCON1) AN8 is using Single-ended mode Position  */
#define ADCHS_ADCIMCON1_SIGN9_Pos             _UINT32_(18)                                         /* (ADCHS_ADCIMCON1) AN9 Signed Data Mode bit Position */
#define ADCHS_ADCIMCON1_SIGN9_Msk             (_UINT32_(0x1) << ADCHS_ADCIMCON1_SIGN9_Pos)         /* (ADCHS_ADCIMCON1) AN9 Signed Data Mode bit Mask */
#define ADCHS_ADCIMCON1_SIGN9(value)          (ADCHS_ADCIMCON1_SIGN9_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_SIGN9_Pos)) /* Assigment of value for SIGN9 in the ADCHS_ADCIMCON1 register */
#define   ADCHS_ADCIMCON1_SIGN9_SIGNED_Val    _UINT32_(0x1)                                        /* (ADCHS_ADCIMCON1) AN9 is using Signed Data mode  */
#define   ADCHS_ADCIMCON1_SIGN9_UNSIGNED_Val  _UINT32_(0x0)                                        /* (ADCHS_ADCIMCON1) AN9 is using Unsigned Data mode  */
#define ADCHS_ADCIMCON1_SIGN9_SIGNED          (ADCHS_ADCIMCON1_SIGN9_SIGNED_Val << ADCHS_ADCIMCON1_SIGN9_Pos) /* (ADCHS_ADCIMCON1) AN9 is using Signed Data mode Position  */
#define ADCHS_ADCIMCON1_SIGN9_UNSIGNED        (ADCHS_ADCIMCON1_SIGN9_UNSIGNED_Val << ADCHS_ADCIMCON1_SIGN9_Pos) /* (ADCHS_ADCIMCON1) AN9 is using Unsigned Data mode Position  */
#define ADCHS_ADCIMCON1_DIFF9_Pos             _UINT32_(19)                                         /* (ADCHS_ADCIMCON1) AN9 Mode bit Position */
#define ADCHS_ADCIMCON1_DIFF9_Msk             (_UINT32_(0x1) << ADCHS_ADCIMCON1_DIFF9_Pos)         /* (ADCHS_ADCIMCON1) AN9 Mode bit Mask */
#define ADCHS_ADCIMCON1_DIFF9(value)          (ADCHS_ADCIMCON1_DIFF9_Msk & (_UINT32_(value) << ADCHS_ADCIMCON1_DIFF9_Pos)) /* Assigment of value for DIFF9 in the ADCHS_ADCIMCON1 register */
