Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz3_wbz35/apps/ble/advanced_applications/ble_sensor_touch/firmware/src/packs/WBZ351_DFP/component/adchs.h
#define ADCHS_ADCIMOD1SET_Msk                 _UINT32_(0x00000000)                                 /* (ADCHS_ADCIMOD1SET) Register Mask  */


/* -------- ADCHS_ADCIMOD1INV : (ADCHS Offset: 0x4C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCIMOD1INV_RESETVALUE          _UINT32_(0x00)                                       /*  (ADCHS_ADCIMOD1INV) Bit invert register  Reset Value */

#define ADCHS_ADCIMOD1INV_Msk                 _UINT32_(0x00000000)                                 /* (ADCHS_ADCIMOD1INV) Register Mask  */


/* -------- ADCHS_ADCGIRQEN1 : (ADCHS Offset: 0x80) (R/W 32)  -------- */
#define ADCHS_ADCGIRQEN1_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCGIRQEN1)   Reset Value */

#define ADCHS_ADCGIRQEN1_AGIEN0_Pos           _UINT32_(0)                                          /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Position */
#define ADCHS_ADCGIRQEN1_AGIEN0_Msk           (_UINT32_(0x1) << ADCHS_ADCGIRQEN1_AGIEN0_Pos)       /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Mask */
#define ADCHS_ADCGIRQEN1_AGIEN0(value)        (ADCHS_ADCGIRQEN1_AGIEN0_Msk & (_UINT32_(value) << ADCHS_ADCGIRQEN1_AGIEN0_Pos)) /* Assigment of value for AGIEN0 in the ADCHS_ADCGIRQEN1 register */
#define   ADCHS_ADCGIRQEN1_AGIEN0_ENABLED_Val _UINT32_(0x1)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN0_DISABLED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN0_ENABLED       (ADCHS_ADCGIRQEN1_AGIEN0_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN0_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position  */
#define ADCHS_ADCGIRQEN1_AGIEN0_DISABLED      (ADCHS_ADCGIRQEN1_AGIEN0_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN0_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are disabled Position  */
#define ADCHS_ADCGIRQEN1_AGIEN1_Pos           _UINT32_(1)                                          /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Position */
#define ADCHS_ADCGIRQEN1_AGIEN1_Msk           (_UINT32_(0x1) << ADCHS_ADCGIRQEN1_AGIEN1_Pos)       /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Mask */
#define ADCHS_ADCGIRQEN1_AGIEN1(value)        (ADCHS_ADCGIRQEN1_AGIEN1_Msk & (_UINT32_(value) << ADCHS_ADCGIRQEN1_AGIEN1_Pos)) /* Assigment of value for AGIEN1 in the ADCHS_ADCGIRQEN1 register */
#define   ADCHS_ADCGIRQEN1_AGIEN1_ENABLED_Val _UINT32_(0x1)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN1_DISABLED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN1_ENABLED       (ADCHS_ADCGIRQEN1_AGIEN1_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN1_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position  */
#define ADCHS_ADCGIRQEN1_AGIEN1_DISABLED      (ADCHS_ADCGIRQEN1_AGIEN1_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN1_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are disabled Position  */
#define ADCHS_ADCGIRQEN1_AGIEN2_Pos           _UINT32_(2)                                          /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Position */
#define ADCHS_ADCGIRQEN1_AGIEN2_Msk           (_UINT32_(0x1) << ADCHS_ADCGIRQEN1_AGIEN2_Pos)       /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Mask */
#define ADCHS_ADCGIRQEN1_AGIEN2(value)        (ADCHS_ADCGIRQEN1_AGIEN2_Msk & (_UINT32_(value) << ADCHS_ADCGIRQEN1_AGIEN2_Pos)) /* Assigment of value for AGIEN2 in the ADCHS_ADCGIRQEN1 register */
#define   ADCHS_ADCGIRQEN1_AGIEN2_ENABLED_Val _UINT32_(0x1)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN2_DISABLED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN2_ENABLED       (ADCHS_ADCGIRQEN1_AGIEN2_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN2_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position  */
#define ADCHS_ADCGIRQEN1_AGIEN2_DISABLED      (ADCHS_ADCGIRQEN1_AGIEN2_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN2_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are disabled Position  */
#define ADCHS_ADCGIRQEN1_AGIEN3_Pos           _UINT32_(3)                                          /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Position */
#define ADCHS_ADCGIRQEN1_AGIEN3_Msk           (_UINT32_(0x1) << ADCHS_ADCGIRQEN1_AGIEN3_Pos)       /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Mask */
#define ADCHS_ADCGIRQEN1_AGIEN3(value)        (ADCHS_ADCGIRQEN1_AGIEN3_Msk & (_UINT32_(value) << ADCHS_ADCGIRQEN1_AGIEN3_Pos)) /* Assigment of value for AGIEN3 in the ADCHS_ADCGIRQEN1 register */
#define   ADCHS_ADCGIRQEN1_AGIEN3_ENABLED_Val _UINT32_(0x1)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN3_DISABLED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN3_ENABLED       (ADCHS_ADCGIRQEN1_AGIEN3_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN3_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position  */
#define ADCHS_ADCGIRQEN1_AGIEN3_DISABLED      (ADCHS_ADCGIRQEN1_AGIEN3_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN3_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are disabled Position  */
#define ADCHS_ADCGIRQEN1_AGIEN4_Pos           _UINT32_(4)                                          /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Position */
#define ADCHS_ADCGIRQEN1_AGIEN4_Msk           (_UINT32_(0x1) << ADCHS_ADCGIRQEN1_AGIEN4_Pos)       /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Mask */
#define ADCHS_ADCGIRQEN1_AGIEN4(value)        (ADCHS_ADCGIRQEN1_AGIEN4_Msk & (_UINT32_(value) << ADCHS_ADCGIRQEN1_AGIEN4_Pos)) /* Assigment of value for AGIEN4 in the ADCHS_ADCGIRQEN1 register */
#define   ADCHS_ADCGIRQEN1_AGIEN4_ENABLED_Val _UINT32_(0x1)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN4_DISABLED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN4_ENABLED       (ADCHS_ADCGIRQEN1_AGIEN4_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN4_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position  */
#define ADCHS_ADCGIRQEN1_AGIEN4_DISABLED      (ADCHS_ADCGIRQEN1_AGIEN4_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN4_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are disabled Position  */
#define ADCHS_ADCGIRQEN1_AGIEN5_Pos           _UINT32_(5)                                          /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Position */
#define ADCHS_ADCGIRQEN1_AGIEN5_Msk           (_UINT32_(0x1) << ADCHS_ADCGIRQEN1_AGIEN5_Pos)       /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Mask */
#define ADCHS_ADCGIRQEN1_AGIEN5(value)        (ADCHS_ADCGIRQEN1_AGIEN5_Msk & (_UINT32_(value) << ADCHS_ADCGIRQEN1_AGIEN5_Pos)) /* Assigment of value for AGIEN5 in the ADCHS_ADCGIRQEN1 register */
#define   ADCHS_ADCGIRQEN1_AGIEN5_ENABLED_Val _UINT32_(0x1)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN5_DISABLED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN5_ENABLED       (ADCHS_ADCGIRQEN1_AGIEN5_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN5_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position  */
#define ADCHS_ADCGIRQEN1_AGIEN5_DISABLED      (ADCHS_ADCGIRQEN1_AGIEN5_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN5_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are disabled Position  */
#define ADCHS_ADCGIRQEN1_AGIEN6_Pos           _UINT32_(6)                                          /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Position */
#define ADCHS_ADCGIRQEN1_AGIEN6_Msk           (_UINT32_(0x1) << ADCHS_ADCGIRQEN1_AGIEN6_Pos)       /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Mask */
#define ADCHS_ADCGIRQEN1_AGIEN6(value)        (ADCHS_ADCGIRQEN1_AGIEN6_Msk & (_UINT32_(value) << ADCHS_ADCGIRQEN1_AGIEN6_Pos)) /* Assigment of value for AGIEN6 in the ADCHS_ADCGIRQEN1 register */
#define   ADCHS_ADCGIRQEN1_AGIEN6_ENABLED_Val _UINT32_(0x1)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN6_DISABLED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN6_ENABLED       (ADCHS_ADCGIRQEN1_AGIEN6_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN6_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position  */
#define ADCHS_ADCGIRQEN1_AGIEN6_DISABLED      (ADCHS_ADCGIRQEN1_AGIEN6_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN6_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are disabled Position  */
#define ADCHS_ADCGIRQEN1_AGIEN7_Pos           _UINT32_(7)                                          /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Position */
#define ADCHS_ADCGIRQEN1_AGIEN7_Msk           (_UINT32_(0x1) << ADCHS_ADCGIRQEN1_AGIEN7_Pos)       /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Mask */
#define ADCHS_ADCGIRQEN1_AGIEN7(value)        (ADCHS_ADCGIRQEN1_AGIEN7_Msk & (_UINT32_(value) << ADCHS_ADCGIRQEN1_AGIEN7_Pos)) /* Assigment of value for AGIEN7 in the ADCHS_ADCGIRQEN1 register */
#define   ADCHS_ADCGIRQEN1_AGIEN7_ENABLED_Val _UINT32_(0x1)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN7_DISABLED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN7_ENABLED       (ADCHS_ADCGIRQEN1_AGIEN7_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN7_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position  */
#define ADCHS_ADCGIRQEN1_AGIEN7_DISABLED      (ADCHS_ADCGIRQEN1_AGIEN7_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN7_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are disabled Position  */
#define ADCHS_ADCGIRQEN1_AGIEN8_Pos           _UINT32_(8)                                          /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Position */
#define ADCHS_ADCGIRQEN1_AGIEN8_Msk           (_UINT32_(0x1) << ADCHS_ADCGIRQEN1_AGIEN8_Pos)       /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Mask */
#define ADCHS_ADCGIRQEN1_AGIEN8(value)        (ADCHS_ADCGIRQEN1_AGIEN8_Msk & (_UINT32_(value) << ADCHS_ADCGIRQEN1_AGIEN8_Pos)) /* Assigment of value for AGIEN8 in the ADCHS_ADCGIRQEN1 register */
#define   ADCHS_ADCGIRQEN1_AGIEN8_ENABLED_Val _UINT32_(0x1)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN8_DISABLED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN8_ENABLED       (ADCHS_ADCGIRQEN1_AGIEN8_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN8_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position  */
#define ADCHS_ADCGIRQEN1_AGIEN8_DISABLED      (ADCHS_ADCGIRQEN1_AGIEN8_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN8_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are disabled Position  */
#define ADCHS_ADCGIRQEN1_AGIEN9_Pos           _UINT32_(9)                                          /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Position */
#define ADCHS_ADCGIRQEN1_AGIEN9_Msk           (_UINT32_(0x1) << ADCHS_ADCGIRQEN1_AGIEN9_Pos)       /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Mask */
#define ADCHS_ADCGIRQEN1_AGIEN9(value)        (ADCHS_ADCGIRQEN1_AGIEN9_Msk & (_UINT32_(value) << ADCHS_ADCGIRQEN1_AGIEN9_Pos)) /* Assigment of value for AGIEN9 in the ADCHS_ADCGIRQEN1 register */
#define   ADCHS_ADCGIRQEN1_AGIEN9_ENABLED_Val _UINT32_(0x1)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN9_DISABLED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN9_ENABLED       (ADCHS_ADCGIRQEN1_AGIEN9_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN9_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position  */
#define ADCHS_ADCGIRQEN1_AGIEN9_DISABLED      (ADCHS_ADCGIRQEN1_AGIEN9_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN9_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are disabled Position  */
#define ADCHS_ADCGIRQEN1_AGIEN10_Pos          _UINT32_(10)                                         /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Position */
#define ADCHS_ADCGIRQEN1_AGIEN10_Msk          (_UINT32_(0x1) << ADCHS_ADCGIRQEN1_AGIEN10_Pos)      /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Mask */
#define ADCHS_ADCGIRQEN1_AGIEN10(value)       (ADCHS_ADCGIRQEN1_AGIEN10_Msk & (_UINT32_(value) << ADCHS_ADCGIRQEN1_AGIEN10_Pos)) /* Assigment of value for AGIEN10 in the ADCHS_ADCGIRQEN1 register */
#define   ADCHS_ADCGIRQEN1_AGIEN10_ENABLED_Val _UINT32_(0x1)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN10_DISABLED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN10_ENABLED      (ADCHS_ADCGIRQEN1_AGIEN10_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN10_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position  */
#define ADCHS_ADCGIRQEN1_AGIEN10_DISABLED     (ADCHS_ADCGIRQEN1_AGIEN10_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN10_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are disabled Position  */
#define ADCHS_ADCGIRQEN1_AGIEN11_Pos          _UINT32_(11)                                         /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Position */
#define ADCHS_ADCGIRQEN1_AGIEN11_Msk          (_UINT32_(0x1) << ADCHS_ADCGIRQEN1_AGIEN11_Pos)      /* (ADCHS_ADCGIRQEN1) ADC Global Interrupt Enable bit Mask */
#define ADCHS_ADCGIRQEN1_AGIEN11(value)       (ADCHS_ADCGIRQEN1_AGIEN11_Msk & (_UINT32_(value) << ADCHS_ADCGIRQEN1_AGIEN11_Pos)) /* Assigment of value for AGIEN11 in the ADCHS_ADCGIRQEN1 register */
#define   ADCHS_ADCGIRQEN1_AGIEN11_ENABLED_Val _UINT32_(0x1)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register)  */
#define   ADCHS_ADCGIRQEN1_AGIEN11_DISABLED_Val _UINT32_(0x0)                                        /* (ADCHS_ADCGIRQEN1) Interrupts are disabled  */
#define ADCHS_ADCGIRQEN1_AGIEN11_ENABLED      (ADCHS_ADCGIRQEN1_AGIEN11_ENABLED_Val << ADCHS_ADCGIRQEN1_AGIEN11_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are enabled for the selected analog input. The interrupt is generated after the converted data is ready (indicated by the AIRDYx bit of the ADCDSTAT1 register) Position  */
#define ADCHS_ADCGIRQEN1_AGIEN11_DISABLED     (ADCHS_ADCGIRQEN1_AGIEN11_DISABLED_Val << ADCHS_ADCGIRQEN1_AGIEN11_Pos) /* (ADCHS_ADCGIRQEN1) Interrupts are disabled Position  */
#define ADCHS_ADCGIRQEN1_Msk                  _UINT32_(0x00000FFF)                                 /* (ADCHS_ADCGIRQEN1) Register Mask  */

#define ADCHS_ADCGIRQEN1_AGIEN_Pos            _UINT32_(0)                                          /* (ADCHS_ADCGIRQEN1 Position) ADC Global Interrupt Enable bit */
#define ADCHS_ADCGIRQEN1_AGIEN_Msk            (_UINT32_(0xFFF) << ADCHS_ADCGIRQEN1_AGIEN_Pos)      /* (ADCHS_ADCGIRQEN1 Mask) AGIEN */
#define ADCHS_ADCGIRQEN1_AGIEN(value)         (ADCHS_ADCGIRQEN1_AGIEN_Msk & (_UINT32_(value) << ADCHS_ADCGIRQEN1_AGIEN_Pos)) 

/* -------- ADCHS_ADCGIRQEN1CLR : (ADCHS Offset: 0x84) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCGIRQEN1CLR_RESETVALUE        _UINT32_(0x00)                                       /*  (ADCHS_ADCGIRQEN1CLR) Bit clear register  Reset Value */

#define ADCHS_ADCGIRQEN1CLR_Msk               _UINT32_(0x00000000)                                 /* (ADCHS_ADCGIRQEN1CLR) Register Mask  */


/* -------- ADCHS_ADCGIRQEN1SET : (ADCHS Offset: 0x88) (R/W 32) Bit set register -------- */
#define ADCHS_ADCGIRQEN1SET_RESETVALUE        _UINT32_(0x00)                                       /*  (ADCHS_ADCGIRQEN1SET) Bit set register  Reset Value */

