Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz3_wbz35/apps/ble/advanced_applications/ble_sensor_touch/firmware/src/packs/WBZ351_DFP/component/adchs.h
#define ADCHS_ADCCSS1INV_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCCSS1INV) Register Mask  */


/* -------- ADCHS_ADCDSTAT1 : (ADCHS Offset: 0xC0) (R/W 32)  -------- */
#define ADCHS_ADCDSTAT1_RESETVALUE            _UINT32_(0x00)                                       /*  (ADCHS_ADCDSTAT1)   Reset Value */

#define ADCHS_ADCDSTAT1_ARDY0_Pos             _UINT32_(0)                                          /* (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY0_Msk             (_UINT32_(0x1) << ADCHS_ADCDSTAT1_ARDY0_Pos)         /* (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY0(value)          (ADCHS_ADCDSTAT1_ARDY0_Msk & (_UINT32_(value) << ADCHS_ADCDSTAT1_ARDY0_Pos)) /* Assigment of value for ARDY0 in the ADCHS_ADCDSTAT1 register */
#define ADCHS_ADCDSTAT1_ARDY1_Pos             _UINT32_(1)                                          /* (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY1_Msk             (_UINT32_(0x1) << ADCHS_ADCDSTAT1_ARDY1_Pos)         /* (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY1(value)          (ADCHS_ADCDSTAT1_ARDY1_Msk & (_UINT32_(value) << ADCHS_ADCDSTAT1_ARDY1_Pos)) /* Assigment of value for ARDY1 in the ADCHS_ADCDSTAT1 register */
#define ADCHS_ADCDSTAT1_ARDY2_Pos             _UINT32_(2)                                          /* (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY2_Msk             (_UINT32_(0x1) << ADCHS_ADCDSTAT1_ARDY2_Pos)         /* (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY2(value)          (ADCHS_ADCDSTAT1_ARDY2_Msk & (_UINT32_(value) << ADCHS_ADCDSTAT1_ARDY2_Pos)) /* Assigment of value for ARDY2 in the ADCHS_ADCDSTAT1 register */
#define ADCHS_ADCDSTAT1_ARDY3_Pos             _UINT32_(3)                                          /* (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY3_Msk             (_UINT32_(0x1) << ADCHS_ADCDSTAT1_ARDY3_Pos)         /* (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY3(value)          (ADCHS_ADCDSTAT1_ARDY3_Msk & (_UINT32_(value) << ADCHS_ADCDSTAT1_ARDY3_Pos)) /* Assigment of value for ARDY3 in the ADCHS_ADCDSTAT1 register */
#define ADCHS_ADCDSTAT1_ARDY4_Pos             _UINT32_(4)                                          /* (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY4_Msk             (_UINT32_(0x1) << ADCHS_ADCDSTAT1_ARDY4_Pos)         /* (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY4(value)          (ADCHS_ADCDSTAT1_ARDY4_Msk & (_UINT32_(value) << ADCHS_ADCDSTAT1_ARDY4_Pos)) /* Assigment of value for ARDY4 in the ADCHS_ADCDSTAT1 register */
#define ADCHS_ADCDSTAT1_ARDY5_Pos             _UINT32_(5)                                          /* (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY5_Msk             (_UINT32_(0x1) << ADCHS_ADCDSTAT1_ARDY5_Pos)         /* (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY5(value)          (ADCHS_ADCDSTAT1_ARDY5_Msk & (_UINT32_(value) << ADCHS_ADCDSTAT1_ARDY5_Pos)) /* Assigment of value for ARDY5 in the ADCHS_ADCDSTAT1 register */
#define ADCHS_ADCDSTAT1_ARDY6_Pos             _UINT32_(6)                                          /* (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY6_Msk             (_UINT32_(0x1) << ADCHS_ADCDSTAT1_ARDY6_Pos)         /* (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY6(value)          (ADCHS_ADCDSTAT1_ARDY6_Msk & (_UINT32_(value) << ADCHS_ADCDSTAT1_ARDY6_Pos)) /* Assigment of value for ARDY6 in the ADCHS_ADCDSTAT1 register */
#define ADCHS_ADCDSTAT1_ARDY7_Pos             _UINT32_(7)                                          /* (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY7_Msk             (_UINT32_(0x1) << ADCHS_ADCDSTAT1_ARDY7_Pos)         /* (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY7(value)          (ADCHS_ADCDSTAT1_ARDY7_Msk & (_UINT32_(value) << ADCHS_ADCDSTAT1_ARDY7_Pos)) /* Assigment of value for ARDY7 in the ADCHS_ADCDSTAT1 register */
#define ADCHS_ADCDSTAT1_ARDY8_Pos             _UINT32_(8)                                          /* (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY8_Msk             (_UINT32_(0x1) << ADCHS_ADCDSTAT1_ARDY8_Pos)         /* (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY8(value)          (ADCHS_ADCDSTAT1_ARDY8_Msk & (_UINT32_(value) << ADCHS_ADCDSTAT1_ARDY8_Pos)) /* Assigment of value for ARDY8 in the ADCHS_ADCDSTAT1 register */
#define ADCHS_ADCDSTAT1_ARDY9_Pos             _UINT32_(9)                                          /* (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY9_Msk             (_UINT32_(0x1) << ADCHS_ADCDSTAT1_ARDY9_Pos)         /* (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY9(value)          (ADCHS_ADCDSTAT1_ARDY9_Msk & (_UINT32_(value) << ADCHS_ADCDSTAT1_ARDY9_Pos)) /* Assigment of value for ARDY9 in the ADCHS_ADCDSTAT1 register */
#define ADCHS_ADCDSTAT1_ARDY10_Pos            _UINT32_(10)                                         /* (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY10_Msk            (_UINT32_(0x1) << ADCHS_ADCDSTAT1_ARDY10_Pos)        /* (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY10(value)         (ADCHS_ADCDSTAT1_ARDY10_Msk & (_UINT32_(value) << ADCHS_ADCDSTAT1_ARDY10_Pos)) /* Assigment of value for ARDY10 in the ADCHS_ADCDSTAT1 register */
#define ADCHS_ADCDSTAT1_ARDY11_Pos            _UINT32_(11)                                         /* (ADCHS_ADCDSTAT1)  Position */
#define ADCHS_ADCDSTAT1_ARDY11_Msk            (_UINT32_(0x1) << ADCHS_ADCDSTAT1_ARDY11_Pos)        /* (ADCHS_ADCDSTAT1)  Mask */
#define ADCHS_ADCDSTAT1_ARDY11(value)         (ADCHS_ADCDSTAT1_ARDY11_Msk & (_UINT32_(value) << ADCHS_ADCDSTAT1_ARDY11_Pos)) /* Assigment of value for ARDY11 in the ADCHS_ADCDSTAT1 register */
#define ADCHS_ADCDSTAT1_Msk                   _UINT32_(0x00000FFF)                                 /* (ADCHS_ADCDSTAT1) Register Mask  */

#define ADCHS_ADCDSTAT1_ARDY_Pos              _UINT32_(0)                                          /* (ADCHS_ADCDSTAT1 Position)  */
#define ADCHS_ADCDSTAT1_ARDY_Msk              (_UINT32_(0xFFF) << ADCHS_ADCDSTAT1_ARDY_Pos)        /* (ADCHS_ADCDSTAT1 Mask) ARDY */
#define ADCHS_ADCDSTAT1_ARDY(value)           (ADCHS_ADCDSTAT1_ARDY_Msk & (_UINT32_(value) << ADCHS_ADCDSTAT1_ARDY_Pos)) 

/* -------- ADCHS_ADCDSTAT1CLR : (ADCHS Offset: 0xC4) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCDSTAT1CLR_RESETVALUE         _UINT32_(0x00)                                       /*  (ADCHS_ADCDSTAT1CLR) Bit clear register  Reset Value */

#define ADCHS_ADCDSTAT1CLR_Msk                _UINT32_(0x00000000)                                 /* (ADCHS_ADCDSTAT1CLR) Register Mask  */


/* -------- ADCHS_ADCDSTAT1SET : (ADCHS Offset: 0xC8) (R/W 32) Bit set register -------- */
#define ADCHS_ADCDSTAT1SET_RESETVALUE         _UINT32_(0x00)                                       /*  (ADCHS_ADCDSTAT1SET) Bit set register  Reset Value */

#define ADCHS_ADCDSTAT1SET_Msk                _UINT32_(0x00000000)                                 /* (ADCHS_ADCDSTAT1SET) Register Mask  */


/* -------- ADCHS_ADCDSTAT1INV : (ADCHS Offset: 0xCC) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCDSTAT1INV_RESETVALUE         _UINT32_(0x00)                                       /*  (ADCHS_ADCDSTAT1INV) Bit invert register  Reset Value */

