Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz3_wbz35/apps/ble/advanced_applications/ble_sensor_touch/firmware/src/packs/WBZ351_DFP/component/adchs.h
#define ADCHS_ADCCMPCON1CLR_Msk               _UINT32_(0x00000000)                                 /* (ADCHS_ADCCMPCON1CLR) Register Mask  */


/* -------- ADCHS_ADCCMPCON1SET : (ADCHS Offset: 0x288) (R/W 32) Bit set register -------- */
#define ADCHS_ADCCMPCON1SET_RESETVALUE        _UINT32_(0x00)                                       /*  (ADCHS_ADCCMPCON1SET) Bit set register  Reset Value */

#define ADCHS_ADCCMPCON1SET_Msk               _UINT32_(0x00000000)                                 /* (ADCHS_ADCCMPCON1SET) Register Mask  */


/* -------- ADCHS_ADCCMPCON1INV : (ADCHS Offset: 0x28C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCCMPCON1INV_RESETVALUE        _UINT32_(0x00)                                       /*  (ADCHS_ADCCMPCON1INV) Bit invert register  Reset Value */

#define ADCHS_ADCCMPCON1INV_Msk               _UINT32_(0x00000000)                                 /* (ADCHS_ADCCMPCON1INV) Register Mask  */


/* -------- ADCHS_ADCCMPCON2 : (ADCHS Offset: 0x290) (R/W 32)  -------- */
#define ADCHS_ADCCMPCON2_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCCMPCON2)   Reset Value */

#define ADCHS_ADCCMPCON2_IELOLO_Pos           _UINT32_(0)                                          /* (ADCHS_ADCCMPCON2)  Position */
#define ADCHS_ADCCMPCON2_IELOLO_Msk           (_UINT32_(0x1) << ADCHS_ADCCMPCON2_IELOLO_Pos)       /* (ADCHS_ADCCMPCON2)  Mask */
#define ADCHS_ADCCMPCON2_IELOLO(value)        (ADCHS_ADCCMPCON2_IELOLO_Msk & (_UINT32_(value) << ADCHS_ADCCMPCON2_IELOLO_Pos)) /* Assigment of value for IELOLO in the ADCHS_ADCCMPCON2 register */
#define ADCHS_ADCCMPCON2_IELOHI_Pos           _UINT32_(1)                                          /* (ADCHS_ADCCMPCON2)  Position */
#define ADCHS_ADCCMPCON2_IELOHI_Msk           (_UINT32_(0x1) << ADCHS_ADCCMPCON2_IELOHI_Pos)       /* (ADCHS_ADCCMPCON2)  Mask */
#define ADCHS_ADCCMPCON2_IELOHI(value)        (ADCHS_ADCCMPCON2_IELOHI_Msk & (_UINT32_(value) << ADCHS_ADCCMPCON2_IELOHI_Pos)) /* Assigment of value for IELOHI in the ADCHS_ADCCMPCON2 register */
#define ADCHS_ADCCMPCON2_IEHILO_Pos           _UINT32_(2)                                          /* (ADCHS_ADCCMPCON2)  Position */
#define ADCHS_ADCCMPCON2_IEHILO_Msk           (_UINT32_(0x1) << ADCHS_ADCCMPCON2_IEHILO_Pos)       /* (ADCHS_ADCCMPCON2)  Mask */
#define ADCHS_ADCCMPCON2_IEHILO(value)        (ADCHS_ADCCMPCON2_IEHILO_Msk & (_UINT32_(value) << ADCHS_ADCCMPCON2_IEHILO_Pos)) /* Assigment of value for IEHILO in the ADCHS_ADCCMPCON2 register */
#define ADCHS_ADCCMPCON2_IEHIHI_Pos           _UINT32_(3)                                          /* (ADCHS_ADCCMPCON2)  Position */
#define ADCHS_ADCCMPCON2_IEHIHI_Msk           (_UINT32_(0x1) << ADCHS_ADCCMPCON2_IEHIHI_Pos)       /* (ADCHS_ADCCMPCON2)  Mask */
#define ADCHS_ADCCMPCON2_IEHIHI(value)        (ADCHS_ADCCMPCON2_IEHIHI_Msk & (_UINT32_(value) << ADCHS_ADCCMPCON2_IEHIHI_Pos)) /* Assigment of value for IEHIHI in the ADCHS_ADCCMPCON2 register */
#define ADCHS_ADCCMPCON2_IEBTWN_Pos           _UINT32_(4)                                          /* (ADCHS_ADCCMPCON2)  Position */
#define ADCHS_ADCCMPCON2_IEBTWN_Msk           (_UINT32_(0x1) << ADCHS_ADCCMPCON2_IEBTWN_Pos)       /* (ADCHS_ADCCMPCON2)  Mask */
#define ADCHS_ADCCMPCON2_IEBTWN(value)        (ADCHS_ADCCMPCON2_IEBTWN_Msk & (_UINT32_(value) << ADCHS_ADCCMPCON2_IEBTWN_Pos)) /* Assigment of value for IEBTWN in the ADCHS_ADCCMPCON2 register */
#define ADCHS_ADCCMPCON2_DCMPED_Pos           _UINT32_(5)                                          /* (ADCHS_ADCCMPCON2)  Position */
#define ADCHS_ADCCMPCON2_DCMPED_Msk           (_UINT32_(0x1) << ADCHS_ADCCMPCON2_DCMPED_Pos)       /* (ADCHS_ADCCMPCON2)  Mask */
#define ADCHS_ADCCMPCON2_DCMPED(value)        (ADCHS_ADCCMPCON2_DCMPED_Msk & (_UINT32_(value) << ADCHS_ADCCMPCON2_DCMPED_Pos)) /* Assigment of value for DCMPED in the ADCHS_ADCCMPCON2 register */
#define ADCHS_ADCCMPCON2_DCMPGIEN_Pos         _UINT32_(6)                                          /* (ADCHS_ADCCMPCON2)  Position */
#define ADCHS_ADCCMPCON2_DCMPGIEN_Msk         (_UINT32_(0x1) << ADCHS_ADCCMPCON2_DCMPGIEN_Pos)     /* (ADCHS_ADCCMPCON2)  Mask */
#define ADCHS_ADCCMPCON2_DCMPGIEN(value)      (ADCHS_ADCCMPCON2_DCMPGIEN_Msk & (_UINT32_(value) << ADCHS_ADCCMPCON2_DCMPGIEN_Pos)) /* Assigment of value for DCMPGIEN in the ADCHS_ADCCMPCON2 register */
#define ADCHS_ADCCMPCON2_ENDCMP_Pos           _UINT32_(7)                                          /* (ADCHS_ADCCMPCON2)  Position */
#define ADCHS_ADCCMPCON2_ENDCMP_Msk           (_UINT32_(0x1) << ADCHS_ADCCMPCON2_ENDCMP_Pos)       /* (ADCHS_ADCCMPCON2)  Mask */
#define ADCHS_ADCCMPCON2_ENDCMP(value)        (ADCHS_ADCCMPCON2_ENDCMP_Msk & (_UINT32_(value) << ADCHS_ADCCMPCON2_ENDCMP_Pos)) /* Assigment of value for ENDCMP in the ADCHS_ADCCMPCON2 register */
#define ADCHS_ADCCMPCON2_AINID_Pos            _UINT32_(8)                                          /* (ADCHS_ADCCMPCON2)  Position */
#define ADCHS_ADCCMPCON2_AINID_Msk            (_UINT32_(0x1F) << ADCHS_ADCCMPCON2_AINID_Pos)       /* (ADCHS_ADCCMPCON2)  Mask */
#define ADCHS_ADCCMPCON2_AINID(value)         (ADCHS_ADCCMPCON2_AINID_Msk & (_UINT32_(value) << ADCHS_ADCCMPCON2_AINID_Pos)) /* Assigment of value for AINID in the ADCHS_ADCCMPCON2 register */
#define ADCHS_ADCCMPCON2_Msk                  _UINT32_(0x00001FFF)                                 /* (ADCHS_ADCCMPCON2) Register Mask  */


/* -------- ADCHS_ADCMPCON2CLR : (ADCHS Offset: 0x294) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCMPCON2CLR_RESETVALUE         _UINT32_(0x00)                                       /*  (ADCHS_ADCMPCON2CLR) Bit clear register  Reset Value */

#define ADCHS_ADCMPCON2CLR_Msk                _UINT32_(0x00000000)                                 /* (ADCHS_ADCMPCON2CLR) Register Mask  */


/* -------- ADCHS_ADCMPCON2SET : (ADCHS Offset: 0x298) (R/W 32) Bit set register -------- */
#define ADCHS_ADCMPCON2SET_RESETVALUE         _UINT32_(0x00)                                       /*  (ADCHS_ADCMPCON2SET) Bit set register  Reset Value */

