Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz3_wbz35/apps/ble/advanced_applications/ble_sensor_touch/firmware/src/packs/WBZ351_DFP/component/adchs.h
#define ADCHS_ADCMPCON2SET_Msk                _UINT32_(0x00000000)                                 /* (ADCHS_ADCMPCON2SET) Register Mask  */


/* -------- ADCHS_ADCMPCON2INV : (ADCHS Offset: 0x29C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCMPCON2INV_RESETVALUE         _UINT32_(0x00)                                       /*  (ADCHS_ADCMPCON2INV) Bit invert register  Reset Value */

#define ADCHS_ADCMPCON2INV_Msk                _UINT32_(0x00000000)                                 /* (ADCHS_ADCMPCON2INV) Register Mask  */


/* -------- ADCHS_ADCFSTATCLR : (ADCHS Offset: 0x2E4) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCFSTATCLR_RESETVALUE          _UINT32_(0x00)                                       /*  (ADCHS_ADCFSTATCLR) Bit clear register  Reset Value */

#define ADCHS_ADCFSTATCLR_Msk                 _UINT32_(0x00000000)                                 /* (ADCHS_ADCFSTATCLR) Register Mask  */


/* -------- ADCHS_ADCFSTATSET : (ADCHS Offset: 0x2E8) (R/W 32) Bit set register -------- */
#define ADCHS_ADCFSTATSET_RESETVALUE          _UINT32_(0x00)                                       /*  (ADCHS_ADCFSTATSET) Bit set register  Reset Value */

#define ADCHS_ADCFSTATSET_Msk                 _UINT32_(0x00000000)                                 /* (ADCHS_ADCFSTATSET) Register Mask  */


/* -------- ADCHS_ADCFSTATINV : (ADCHS Offset: 0x2EC) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCFSTATINV_RESETVALUE          _UINT32_(0x00)                                       /*  (ADCHS_ADCFSTATINV) Bit invert register  Reset Value */

#define ADCHS_ADCFSTATINV_Msk                 _UINT32_(0x00000000)                                 /* (ADCHS_ADCFSTATINV) Register Mask  */


/* -------- ADCHS_ADCFIFOCLR : (ADCHS Offset: 0x2F4) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCFIFOCLR_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCFIFOCLR) Bit clear register  Reset Value */

#define ADCHS_ADCFIFOCLR_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCFIFOCLR) Register Mask  */


/* -------- ADCHS_ADCFIFOSET : (ADCHS Offset: 0x2F8) (R/W 32) Bit set register -------- */
#define ADCHS_ADCFIFOSET_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCFIFOSET) Bit set register  Reset Value */

#define ADCHS_ADCFIFOSET_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCFIFOSET) Register Mask  */


/* -------- ADCHS_ADCFIFOINV : (ADCHS Offset: 0x2FC) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCFIFOINV_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCFIFOINV) Bit invert register  Reset Value */

#define ADCHS_ADCFIFOINV_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCFIFOINV) Register Mask  */


/* -------- ADCHS_ADCBASE : (ADCHS Offset: 0x300) (R/W 32)  -------- */
#define ADCHS_ADCBASE_RESETVALUE              _UINT32_(0x00)                                       /*  (ADCHS_ADCBASE)   Reset Value */

#define ADCHS_ADCBASE_ADCBASE_Pos             _UINT32_(0)                                          /* (ADCHS_ADCBASE)  Position */
#define ADCHS_ADCBASE_ADCBASE_Msk             (_UINT32_(0xFFFF) << ADCHS_ADCBASE_ADCBASE_Pos)      /* (ADCHS_ADCBASE)  Mask */
#define ADCHS_ADCBASE_ADCBASE(value)          (ADCHS_ADCBASE_ADCBASE_Msk & (_UINT32_(value) << ADCHS_ADCBASE_ADCBASE_Pos)) /* Assigment of value for ADCBASE in the ADCHS_ADCBASE register */
#define ADCHS_ADCBASE_Msk                     _UINT32_(0x0000FFFF)                                 /* (ADCHS_ADCBASE) Register Mask  */


/* -------- ADCHS_ADCBASECLR : (ADCHS Offset: 0x304) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCBASECLR_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCBASECLR) Bit clear register  Reset Value */

#define ADCHS_ADCBASECLR_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCBASECLR) Register Mask  */


/* -------- ADCHS_ADCBASESET : (ADCHS Offset: 0x308) (R/W 32) Bit set register -------- */
#define ADCHS_ADCBASESET_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCBASESET) Bit set register  Reset Value */

#define ADCHS_ADCBASESET_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCBASESET) Register Mask  */


/* -------- ADCHS_ADCBASEINV : (ADCHS Offset: 0x30C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCBASEINV_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCBASEINV) Bit invert register  Reset Value */

#define ADCHS_ADCBASEINV_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCBASEINV) Register Mask  */


/* -------- ADCHS_ADCDMASTATCLR : (ADCHS Offset: 0x314) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCDMASTATCLR_RESETVALUE        _UINT32_(0x00)                                       /*  (ADCHS_ADCDMASTATCLR) Bit clear register  Reset Value */

#define ADCHS_ADCDMASTATCLR_Msk               _UINT32_(0x00000000)                                 /* (ADCHS_ADCDMASTATCLR) Register Mask  */


/* -------- ADCHS_ADCDMASTATSET : (ADCHS Offset: 0x318) (R/W 32) Bit set register -------- */
#define ADCHS_ADCDMASTATSET_RESETVALUE        _UINT32_(0x00)                                       /*  (ADCHS_ADCDMASTATSET) Bit set register  Reset Value */

#define ADCHS_ADCDMASTATSET_Msk               _UINT32_(0x00000000)                                 /* (ADCHS_ADCDMASTATSET) Register Mask  */


/* -------- ADCHS_ADCDMASTATINV : (ADCHS Offset: 0x31C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCDMASTATINV_RESETVALUE        _UINT32_(0x00)                                       /*  (ADCHS_ADCDMASTATINV) Bit invert register  Reset Value */

#define ADCHS_ADCDMASTATINV_Msk               _UINT32_(0x00000000)                                 /* (ADCHS_ADCDMASTATINV) Register Mask  */


