Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz3_wbz35/apps/ble/advanced_applications/ble_sensor_touch/firmware/src/packs/WBZ351_DFP/component/adchs.h
/* -------- ADCHS_ADCCNTB : (ADCHS Offset: 0x320) (R/W 32)  -------- */
#define ADCHS_ADCCNTB_RESETVALUE              _UINT32_(0x00)                                       /*  (ADCHS_ADCCNTB)   Reset Value */

#define ADCHS_ADCCNTB_ADCCNTB_Pos             _UINT32_(0)                                          /* (ADCHS_ADCCNTB)  Position */
#define ADCHS_ADCCNTB_ADCCNTB_Msk             (_UINT32_(0xFFFFFFFF) << ADCHS_ADCCNTB_ADCCNTB_Pos)  /* (ADCHS_ADCCNTB)  Mask */
#define ADCHS_ADCCNTB_ADCCNTB(value)          (ADCHS_ADCCNTB_ADCCNTB_Msk & (_UINT32_(value) << ADCHS_ADCCNTB_ADCCNTB_Pos)) /* Assigment of value for ADCCNTB in the ADCHS_ADCCNTB register */
#define ADCHS_ADCCNTB_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (ADCHS_ADCCNTB) Register Mask  */


/* -------- ADCHS_ADCCNTBCLR : (ADCHS Offset: 0x324) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCCNTBCLR_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCCNTBCLR) Bit clear register  Reset Value */

#define ADCHS_ADCCNTBCLR_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCCNTBCLR) Register Mask  */


/* -------- ADCHS_ADCCNTBSET : (ADCHS Offset: 0x328) (R/W 32) Bit set register -------- */
#define ADCHS_ADCCNTBSET_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCCNTBSET) Bit set register  Reset Value */

#define ADCHS_ADCCNTBSET_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCCNTBSET) Register Mask  */


/* -------- ADCHS_ADCCNTBINV : (ADCHS Offset: 0x32C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCCNTBINV_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCCNTBINV) Bit invert register  Reset Value */

#define ADCHS_ADCCNTBINV_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCCNTBINV) Register Mask  */


/* -------- ADCHS_ADCDMAB : (ADCHS Offset: 0x330) (R/W 32)  -------- */
#define ADCHS_ADCDMAB_RESETVALUE              _UINT32_(0x00)                                       /*  (ADCHS_ADCDMAB)   Reset Value */

#define ADCHS_ADCDMAB_ADDMAB_Pos              _UINT32_(0)                                          /* (ADCHS_ADCDMAB)  Position */
#define ADCHS_ADCDMAB_ADDMAB_Msk              (_UINT32_(0xFFFFFFFF) << ADCHS_ADCDMAB_ADDMAB_Pos)   /* (ADCHS_ADCDMAB)  Mask */
#define ADCHS_ADCDMAB_ADDMAB(value)           (ADCHS_ADCDMAB_ADDMAB_Msk & (_UINT32_(value) << ADCHS_ADCDMAB_ADDMAB_Pos)) /* Assigment of value for ADDMAB in the ADCHS_ADCDMAB register */
#define ADCHS_ADCDMAB_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (ADCHS_ADCDMAB) Register Mask  */


/* -------- ADCHS_ADCDMABCLR : (ADCHS Offset: 0x334) (R/W 32) Bit clear register -------- */
#define ADCHS_ADCDMABCLR_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCDMABCLR) Bit clear register  Reset Value */

#define ADCHS_ADCDMABCLR_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCDMABCLR) Register Mask  */


/* -------- ADCHS_ADCDMABSET : (ADCHS Offset: 0x338) (R/W 32) Bit set register -------- */
#define ADCHS_ADCDMABSET_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCDMABSET) Bit set register  Reset Value */

#define ADCHS_ADCDMABSET_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCDMABSET) Register Mask  */


/* -------- ADCHS_ADCDMABINV : (ADCHS Offset: 0x33C) (R/W 32) Bit invert register -------- */
#define ADCHS_ADCDMABINV_RESETVALUE           _UINT32_(0x00)                                       /*  (ADCHS_ADCDMABINV) Bit invert register  Reset Value */

#define ADCHS_ADCDMABINV_Msk                  _UINT32_(0x00000000)                                 /* (ADCHS_ADCDMABINV) Register Mask  */


/* -------- ADCHS_ADCTRGSNS : (ADCHS Offset: 0x340) (R/W 32)  -------- */
#define ADCHS_ADCTRGSNS_RESETVALUE            _UINT32_(0x00)                                       /*  (ADCHS_ADCTRGSNS)   Reset Value */

#define ADCHS_ADCTRGSNS_LVL0_Pos              _UINT32_(0)                                          /* (ADCHS_ADCTRGSNS)  Position */
#define ADCHS_ADCTRGSNS_LVL0_Msk              (_UINT32_(0x1) << ADCHS_ADCTRGSNS_LVL0_Pos)          /* (ADCHS_ADCTRGSNS)  Mask */
#define ADCHS_ADCTRGSNS_LVL0(value)           (ADCHS_ADCTRGSNS_LVL0_Msk & (_UINT32_(value) << ADCHS_ADCTRGSNS_LVL0_Pos)) /* Assigment of value for LVL0 in the ADCHS_ADCTRGSNS register */
#define ADCHS_ADCTRGSNS_LVL1_Pos              _UINT32_(1)                                          /* (ADCHS_ADCTRGSNS)  Position */
#define ADCHS_ADCTRGSNS_LVL1_Msk              (_UINT32_(0x1) << ADCHS_ADCTRGSNS_LVL1_Pos)          /* (ADCHS_ADCTRGSNS)  Mask */
#define ADCHS_ADCTRGSNS_LVL1(value)           (ADCHS_ADCTRGSNS_LVL1_Msk & (_UINT32_(value) << ADCHS_ADCTRGSNS_LVL1_Pos)) /* Assigment of value for LVL1 in the ADCHS_ADCTRGSNS register */
#define ADCHS_ADCTRGSNS_LVL2_Pos              _UINT32_(2)                                          /* (ADCHS_ADCTRGSNS)  Position */
#define ADCHS_ADCTRGSNS_LVL2_Msk              (_UINT32_(0x1) << ADCHS_ADCTRGSNS_LVL2_Pos)          /* (ADCHS_ADCTRGSNS)  Mask */
#define ADCHS_ADCTRGSNS_LVL2(value)           (ADCHS_ADCTRGSNS_LVL2_Msk & (_UINT32_(value) << ADCHS_ADCTRGSNS_LVL2_Pos)) /* Assigment of value for LVL2 in the ADCHS_ADCTRGSNS register */
#define ADCHS_ADCTRGSNS_LVL3_Pos              _UINT32_(3)                                          /* (ADCHS_ADCTRGSNS)  Position */
#define ADCHS_ADCTRGSNS_LVL3_Msk              (_UINT32_(0x1) << ADCHS_ADCTRGSNS_LVL3_Pos)          /* (ADCHS_ADCTRGSNS)  Mask */
#define ADCHS_ADCTRGSNS_LVL3(value)           (ADCHS_ADCTRGSNS_LVL3_Msk & (_UINT32_(value) << ADCHS_ADCTRGSNS_LVL3_Pos)) /* Assigment of value for LVL3 in the ADCHS_ADCTRGSNS register */
#define ADCHS_ADCTRGSNS_LVL4_Pos              _UINT32_(4)                                          /* (ADCHS_ADCTRGSNS)  Position */
#define ADCHS_ADCTRGSNS_LVL4_Msk              (_UINT32_(0x1) << ADCHS_ADCTRGSNS_LVL4_Pos)          /* (ADCHS_ADCTRGSNS)  Mask */
#define ADCHS_ADCTRGSNS_LVL4(value)           (ADCHS_ADCTRGSNS_LVL4_Msk & (_UINT32_(value) << ADCHS_ADCTRGSNS_LVL4_Pos)) /* Assigment of value for LVL4 in the ADCHS_ADCTRGSNS register */
#define ADCHS_ADCTRGSNS_LVL5_Pos              _UINT32_(5)                                          /* (ADCHS_ADCTRGSNS)  Position */
#define ADCHS_ADCTRGSNS_LVL5_Msk              (_UINT32_(0x1) << ADCHS_ADCTRGSNS_LVL5_Pos)          /* (ADCHS_ADCTRGSNS)  Mask */
#define ADCHS_ADCTRGSNS_LVL5(value)           (ADCHS_ADCTRGSNS_LVL5_Msk & (_UINT32_(value) << ADCHS_ADCTRGSNS_LVL5_Pos)) /* Assigment of value for LVL5 in the ADCHS_ADCTRGSNS register */
#define ADCHS_ADCTRGSNS_LVL6_Pos              _UINT32_(6)                                          /* (ADCHS_ADCTRGSNS)  Position */
#define ADCHS_ADCTRGSNS_LVL6_Msk              (_UINT32_(0x1) << ADCHS_ADCTRGSNS_LVL6_Pos)          /* (ADCHS_ADCTRGSNS)  Mask */
#define ADCHS_ADCTRGSNS_LVL6(value)           (ADCHS_ADCTRGSNS_LVL6_Msk & (_UINT32_(value) << ADCHS_ADCTRGSNS_LVL6_Pos)) /* Assigment of value for LVL6 in the ADCHS_ADCTRGSNS register */
#define ADCHS_ADCTRGSNS_LVL7_Pos              _UINT32_(7)                                          /* (ADCHS_ADCTRGSNS)  Position */
#define ADCHS_ADCTRGSNS_LVL7_Msk              (_UINT32_(0x1) << ADCHS_ADCTRGSNS_LVL7_Pos)          /* (ADCHS_ADCTRGSNS)  Mask */
#define ADCHS_ADCTRGSNS_LVL7(value)           (ADCHS_ADCTRGSNS_LVL7_Msk & (_UINT32_(value) << ADCHS_ADCTRGSNS_LVL7_Pos)) /* Assigment of value for LVL7 in the ADCHS_ADCTRGSNS register */
#define ADCHS_ADCTRGSNS_Msk                   _UINT32_(0x000000FF)                                 /* (ADCHS_ADCTRGSNS) Register Mask  */

#define ADCHS_ADCTRGSNS_LVL_Pos               _UINT32_(0)                                          /* (ADCHS_ADCTRGSNS Position)  */
#define ADCHS_ADCTRGSNS_LVL_Msk               (_UINT32_(0xFF) << ADCHS_ADCTRGSNS_LVL_Pos)          /* (ADCHS_ADCTRGSNS Mask) LVL */
#define ADCHS_ADCTRGSNS_LVL(value)            (ADCHS_ADCTRGSNS_LVL_Msk & (_UINT32_(value) << ADCHS_ADCTRGSNS_LVL_Pos)) 

